[
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-cryptocurrency",
    "text": "Bitcoin, Ethereum, and other crypto are revolutionizing how we invest, bank, and use money. Read this beginner’s guide to learn more.\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-bitcoin",
    "text": "The world’s first widely-adopted cryptocurrency. With Bitcoin, people can securely and directly send each other digital money on the internet.\nBitcoin was created by Satoshi Nakamoto, a pseudonymous person or team who outlined the technology in a 2008 white paper. It’s an appealingly simple concept: bitcoin is digital money that allows for secure peer-to-peer transactions on the internet.\nUnlike services like Venmo and PayPal, which rely on the traditional financial system for permission to transfer money and on existing debit/credit accounts, bitcoin is decentralized: any two people, anywhere in the world, can send bitcoin to each other without the involvement of a bank, government, or other institution.\nEvery transaction involving Bitcoin is tracked on the blockchain, which is similar to a bank’s ledger, or log of customers’ funds going in and out of the bank. In simple terms, it’s a record of every transaction ever made using bitcoin.\nUnlike a bank’s ledger, the Bitcoin blockchain is distributed across the entire network. No company, country, or third party is in control of it; and anyone can become part of that network.\nThere will only ever be 21 million bitcoin. This is digital money that cannot be inflated or manipulated in any way.\nIt isn’t necessary to buy an entire bitcoin: you can buy just a fraction of one if that’s all you want or need.\nKey Questions\nWhat is BTC?\nBTC is the abbreviation for bitcoin.\nIs Bitcoin cryptocurrency?\nYes, bitcoin is the first widely adopted cryptocurrency, which is just another way of saying digital money.\nIs there a simple bitcoin definition?\nBitcoin is a decentralized digital currency used for encrypted, peer-to-peer transactions without needing a central bank\nWhat's the price of bitcoin?\nThe current price of Bitcoin can be found on Coinbase's website.\nIs Bitcoin an investment opportunity?\nLike any other asset, you can make money by buying BTC low and selling high, or lose money in the inverse scenario.\nAt what price did Bitcoin start?\nOne BTC was valued at a fraction of a U.S. penny in early 2010. During the first quarter of 2011, it exceeded a dollar. In late 2017, its value skyrocketed, topping out at close to $20,000, and Bitcoin ended up topping $64,899 in November 2021. You can track the price of bitcoin here.\nBitcoin is a decentralized digital currency used for encrypted, peer-to-peer transactions without needing a central bank\nWhat Is Bitcoin? by Coinbase CEO Brian Armstrong Buy your first Bitcoin Start with as little as $25 Get started\nSince Bitcoin’s creation, thousands of new cryptocurrencies have been launched, but bitcoin (abbreviated as BTC) remains the largest by market capitalization and trading volume.\nDepending on your goals, bitcoin can function as\n- an investment vehicle\n- a store of value similar to gold\n- a way to transfer value around the world\n- even just a way to explore an emerging technology\nBitcoin is a currency native to the Internet. Unlike government-issued currencies such as the dollar or euro, Bitcoin allows online transfers without a middleman such as a bank or payment processor. The removal of those gatekeepers creates a whole range of new possibilities, including the potential for money to move around the global internet more quickly and cheaply, and allowing individuals to have maximum control over their own assets.\nBitcoin is legal to use, hold, and trade, and can be spent on everything from travel to charitable donations. It’s accepted as payment by businesses including Microsoft and Expedia.\nIs bitcoin money? It’s been used as a medium of exchange, a store of value, and a unit of account—which are all properties of money. Meanwhile, it only exists digitally; there is no physical version of it.\nTo really grasp how bitcoin works, it helps to start at the beginning. The question of who created bitcoin is a fascinating one, because a decade after inventing the technology—and despite a lot of digging by journalists and members of the crypto community—its creator remains anonymous.\nThe principles behind Bitcoin first appeared in a white paper published online in late 2008 by a person or group going by the name Satoshi Nakamoto.\nThis paper wasn’t the first idea for digital money drawing on the fields of cryptography and computer science—in fact, the paper referred to earlier concepts—but it was a uniquely elegant solution to the problem of establishing trust between different online entities, where people may be hidden (like bitcoin’s own creator) by pseudonyms, or physically located on the other side of the planet.\nNakamoto devised a pair of intertwined concepts: the bitcoin private key and the blockchain ledger. When you hold bitcoin, you control it through a private key—a string of randomized numbers and letters that unlocks a virtual vault containing your purchase. Each private key is tracked on the virtual ledger called the blockchain.\nWhen Bitcoin first appeared, it marked a major advance in computer science, because it solved a fundamental problem of commerce on the internet: how do you transfer value between two people without a trusted intermediary (like a bank) in the middle? By solving that problem, the invention of bitcoin has wide-ranging ramifications: As a currency designed for the internet, it allows for financial transactions that range across borders and around the globe without the involvement of banks, credit-card companies, lenders, or even governments. When any two people—wherever they might live—can send payments to each other without encountering those gatekeepers, it creates the potential for an open financial system that is more efficient, more free, and more innovative. That, in a nutshell, is bitcoin explained.\nBitcoin creates the potential for an open financial system that is more efficient, more free, and more innovative.\nUnlike credit card networks like Visa and payment processors like Paypal, bitcoin is not owned by an individual or company. Bitcoin is the world’s first completely open payment network which anyone with an internet connection can participate in. Bitcoin was designed to be used on the internet, and doesn’t depend on banks or private companies to process transactions.\nOne of the most important elements of Bitcoin is the blockchain, which tracks who owns what, similar to how a bank tracks assets. What sets the Bitcoin blockchain apart from a bank's ledger is that it is decentralized, meaning anyone can view it and no single entity controls it.\nHere are some details about how it all works:\nSpecialized computers known as ‘mining rigs’ perform the equations required to verify and record a new transaction. In the early days, a typical desktop PC was powerful enough to participate, which allowed pretty much anyone who was curious to try their hand at mining. These days the computers required are massive, specialized, and often owned by businesses or large numbers of individuals pooling their resources. (In October 2019, it required 12 trillion times more computing power to mine one bitcoin than it did when Nakamoto mined the first blocks in January 2009.)\nThe miners’ collective computing power is used to ensure the accuracy of the ever-growing ledger. Bitcoin is inextricably tied to the blockchain; each new bitcoin is recorded on it, as is each subsequent transaction with all existing coins.\nHow does the network motivate miners to participate in the constant, essential work of maintaining the blockchain—verifying transactions? The Bitcoin network holds a continuous lottery in which all the mining rigs around the world race to be the first to solve a math problem. Every 10 min or so, a winner is found, and the winner updates the Bitcoin ledger with new valid transactions. The prize changes over time, but in May 2020, the reward for each winner of this raffle went from 12.5 bitcoin per block to 6.25, and in 2024, with the halving, this reward further dropped from 6.25 to 3.125 as a mechanism to increase scarcity.\nAt the beginning, a bitcoin was technically worthless. At the end of 2019, it was trading at around $7,500, and in November 2021, it topped $64,000. As bitcoin’s value has risen, its easy divisibility (the ability to buy a small fraction of one bitcoin) has become a key attribute. One bitcoin is currently divisible to eight decimal places (100 millionths of one bitcoin); the bitcoin community refers to the smallest unit as a ‘Satoshi.’\nNakamoto set the network up so that the number of bitcoin will never exceed 21 million, ensuring scarcity. As of December 2023, there were around 1,4 million bitcoins still available to be mined. The last blocks will theoretically be mined in 2140.\nCryptocurrencies and traditional currencies share some traits — like how you can use them to buy things or how you can transfer them electronically — but they’re also different in interesting ways. Here are a few highlights.\nBitcoin is the world’s first completely open payment network which anyone with an internet connection can participate in.\nKey question\nHow does bitcoin have value?\nEssentially the same way a traditional currency does – because it’s proven itself to be a viable and convenient way to store value, which means it can easily be traded for goods, services, or other assets. It’s scarce, secure, portable (compared to, say, gold), and easily divisible, allowing transactions of all sizes.\nThe easiest way to buy bitcoin is to purchase it through an online exchange like Coinbase. Coinbase makes it easy to buy, sell, send, receive, and store bitcoin without needing to hold it yourself using something called public and private keys.\nHow to buy bitcoin, with Coinbase CEO Brian Armstrong\nHowever, if you choose to buy and store bitcoin outside of an online exchange, here’s how that works.\nEach person who joins the bitcoin network is issued a public key, which is a long string of letters and numbers that you can think of like an email address, and a private key, which is equivalent to a password.\nWhen you buy bitcoin—or send/receive it—you get a public key, which you can think of as a key that unlocks a virtual vault and gives you access to your money.\nAnyone can send bitcoin to you via your public key, but only the holder of the private key can access the bitcoin in the “virtual vault” once it’s been sent.\nThere are many ways to store bitcoin both online and off. The simplest solution is a virtual wallet.\nIf you want to transfer money from your wallet to a bank account after selling your bitcoin, the Coinbase app makes it as easy as transferring funds from one bank to another. Similar to conventional bank transfers or ATM withdrawals, exchanges like Coinbase set a daily limit, and it may take between a few days and a week for the transaction to be completed.\nThe easiest way to buy bitcoin is to purchase it through an online exchange like Coinbase.\nKey question\nWhat’s the difference between Bitcoin and Blockchain?\nAll bitcoin transactions and public keys are recorded on a virtual ledger called the blockchain. The ledger is effectively a chronological list of transactions. This ledger is copied—exactly—across every computer that is connected to the bitcoin network, and it is constantly checked and secured using a vast amount of computing power across the globe. The blockchain concept has turned out to be powerful and adaptable, and there are now a wide variety of non-cryptocurrency-related blockchains that are used for things like supply-chain management. The ‘Bitcoin Blockchain’ specifically refers to the virtual ledger that records bitcoin transactions and private keys.\nBack in 2013, a bitcoin enthusiast named Laszlo Hanyecz created a message-board post offering 10,000 BTC – which then was worth around $25 – to anyone who would deliver two pizzas to his Jacksonville, Florida, home. As the legend goes, those two pizzas, which another bitcoin early-adopter bought from a local Papa John’s, marked the first successful purchase of non-virtual goods using bitcoin. Thankfully it’s a lot easier to use bitcoin these days!\nIt’s simple: Transactions using BTC aren’t that different from those using a credit or debit card, but instead of being asked to enter card info, you’ll simply be entering the payment amount and the vendor’s public key (similar to an email address) via a wallet app. (When transacting in person using smartphones or tablets, often a QR code will pop up to simplify the process – when you scan the code, your wallet app will automatically enter the pertinent information.)\nIt’s private: One of the benefits of paying with bitcoin is that doing so limits the amount of personal information you need to provide. The only time you need to share your name and address is if you’re purchasing physical goods that need to be shipped.\nIt’s flexible: As to what you should do with your bitcoin, that depends completely on your personal interests. Here are some ideas:\nYou can sell it for cash using an exchange or a Bitcoin ATM.\nYou can spend it online or in brick-and-mortar retailers as you would any other currency by using a Bitcoin debit card.\nYou can hold on to some or all of it as part of your investment and savings strategy.\nYou might choose to that is close to your heart (check out).\nAnd if you have a serious budget and unfulfilled astronaut dreams? Richard Branson’s Virgin Galactic happily accepts BTC in exchange for the opportunity to blast off on one of its forthcoming space-tourism missions.\nDue to the cryptographic nature of the Bitcoin network, bitcoin payments are fundamentally more secure than standard debit/credit card transactions.\nBitcoin is global. You can send it across the planet as easily as you can pay with cash in the physical world. It isn't closed on weekends, doesn’t charge you a fee to access your money, and doesn't impose any arbitrary limits.\nBitcoin is irreversible. Bitcoin is like cash, in the sense that transactions cannot be reversed by the sender. In comparison, credit cards, conventional online payment systems, and banking transactions can be reversed after the payment has been made—sometimes months after the initial transaction—due to the centralized intermediaries that complete the transactions. This creates higher fraud risk for merchants, which can lead to higher fees for using credit cards.\nBitcoin is private. When paying with bitcoin, there are no bank statements, or any need to provide unnecessary personal information to the merchant. Bitcoin transactions don’t contain any identifying information other than the bitcoin addresses and amounts involved.\nBitcoin is secure. Due to the cryptographic nature of the Bitcoin network, bitcoin payments are fundamentally more secure than standard debit/credit card transactions. When making a bitcoin payment, no sensitive information is required to be sent over the internet. There is a very low risk of your financial information being compromised, or having your identity stolen.\nBitcoin is open. Every transaction on the Bitcoin network is published publicly, without exception. This means there's no room for manipulation of transactions (save for a highly unlikely 51% attack scenario) or changing the supply of bitcoin. The software that constitutes the core of Bitcoin is free and open-source so anyone can review the code.\nBitcoin is safe. In more than ten years of existence, the bitcoin network has never been successfully hacked. And because the system is permissionless and open-sourced, countless computer scientists and cryptographers have been able to examine all aspects of the network and its security.\nBitcoin is virtually ‘mined’ by a vast, decentralized (also referred to as ‘peer-to-peer’) network of computers that are constantly verifying and securing the accuracy of the blockchain. Every single bitcoin transaction is reflected on that ledger, with new information periodically gathered together in a “block,” which is added to all the blocks that came before.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-blockchain",
    "text": "Cryptocurrencies like Bitcoin and Ethereum are powered by a technology called the blockchain. At its most basic, a blockchain is a list of transactions that anyone can view and verify. The Cryptocurrencies and the blockchain technology that powers them make it possible to transfer value online without the need for a middleman like a bank or credit card company.\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-ethereum",
    "text": "From how to buy it and how it works to smart contracts and ETH2, a complete beginner's guide to the second-biggest cryptocurrency\nEthereum is the second-biggest cryptocurrency by market cap after Bitcoin. It is also a decentralized computing platform that can run a wide variety of applications — including the entire universe of DeFi.\nEthereum, which launched in 2015, is the second-biggest cryptocurrency by market cap after Bitcoin. But unlike Bitcoin, it wasn’t created to be digital money. Instead, Ethereum’s founders set out to build a new kind of global, decentralized computing platform that takes the security and openness of blockchains and extends those attributes to a vast range of applications.  \nEverything from financial tools and games to complex databases are already running on the Ethereum blockchain. And its future potential is only limited by developers’ imaginations. As the nonprofit Ethereum Foundation puts it: “Ethereum can be used to codify, decentralize, secure and trade just about anything.”\nEthereum has become a popular investment vehicle and store of wealth (and can be used, like Bitcoin, to send or receive value without an intermediary).\nThe Ethereum blockchain allows developers to build and run a huge variety of applications: everything from games and advanced databases to complex decentralized financial instruments — meaning that they don’t require a bank or any other institution in the middle. \nEthereum-based apps are built using “smart contracts.” Smart contracts, like regular paper contracts, establish the terms of an arrangement between parties. But unlike an old-fashioned contract, smart contracts automatically execute when the terms are met without the need for either participating party to know who is on the other side of the deal — and without the need for any kind of intermediary. \nEthereum, like Bitcoin, is an open source project that is not owned or operated by a single individual. Anyone with an internet connection can run an Ethereum node or interact with the network.\nMuch like Bitcoin’s decentralized blockchain allows any two strangers, anywhere in the world, to send or receive money without a bank in the middle, smart contracts running on Ethereum’s decentralized blockchain allow developers to build complex applications that should run exactly as programmed without downtime, censorship, fraud, or third-party interference. \nPopular Ethereum-based innovations include stablecoins, decentralized finance apps (collectively known as DeFi), and other decentralized apps (or dapps).\nWhat’s the difference between Ethereum, Ether, and ETH?\nEthereum is the name of the network. “Ether” is the native cryptocurrency token used by the Ethereum network. That said, in day-to-day usage most people call the token “ETH” (or just “Ethereum”). As a way of sending, receiving, or storing value ETH works much like Bitcoin. But it also has a special role on the Ethereum network. Because users pay fees in ETH to execute smart contracts, you can think of it as the fuel that keeps the whole thing running (which is why those fees are called “gas”).\nIf Bitcoin is “digital gold,” ETH can be seen as “digital oil.”\nETH is currently secured by the Ethereum blockchain using a technology called “proof of stake” (more on this below).\nThe fundamental ideas behind cryptocurrencies help make them safe: the systems are permissionless and the core software is open-source, meaning countless computer scientists and cryptographers have been able to examine all aspects of the networks and their security. \nApps running on the Ethereum blockchain, however, are only guaranteed to be as secure as their developers have made them. For example, code can sometimes contain bugs that could result in loss of funds. While their source code is also visible to all, the user bases of each individual app are much smaller than Ethereum’s as a whole, and so fewer eyes are on them. It’s important to do research on any decentralized app you plan to use. \nYou might have heard that the Bitcoin blockchain is a lot like a bank’s ledger, or even a checkbook. It’s a running tally of every transaction made on the network going back to the very beginning — and the entire network works together to ensure that the tally is accurate and secure.\nThe Ethereum blockchain, on the other hand, is more like a computer: While it also does the work of documenting and securing transactions, it’s much more flexible than the Bitcoin blockchain. Developers can use the Ethereum blockchain to build a huge variety of tools — everything from logistics management software to games to the entire universe of DeFi applications (which span lending, borrowing, trading, and more).\nEthereum uses a 'virtual machine' to achieve all this, which is like a giant, global computer made up of many individual computers running the Ethereum software. Keeping all of those computers running involves investment in both hardware and electricity by participants. To cover those costs, the network uses its own Bitcoin-like cryptocurrency called Ether (or, more commonly, ETH).\nETH keeps the whole thing running. You interact with the Ethereum network by using ETH to pay the network to execute smart contracts. As a result, the fees paid in ETH are called “gas.”\nGas rates vary depending on how busy the network is. A new version of the Ethereum blockchain called Ethereum 2.0, which aims to increase efficiency, was implemented in September 2022.\nEthereum 2.0 (often referred to as ETH2) is a major upgrade to the Ethereum network. It’s been designed to allow the Ethereum network to grow while increasing security, speed, and efficiency, and was implemented in September 2022, merging the original blockchain with the ETH2 blockchain.\nWhy is Ethereum 2.0 necessary? Moving a popular cryptoasset to a new platform is a complex endeavor, but for Ethereum to scale and evolve, it needed to happen. That’s because the “Proof of Work” method used by the ETH 1.0 blockchain to verify transactions caused bottlenecks, increased fees, and consumed substantial resources (particularly electricity).\nWhat is Proof of Work?  How do cryptocurrency networks make sure that nobody spends the same money twice without a central authority like Visa or Paypal in the middle? They use a consensus mechanism. When ETH 1.0 launched, it adopted the consensus mechanism pioneered by Bitcoin: the aptly named Proof of Work. \nProof of Work requires a huge amount of processing power, which is contributed by virtual “miners” around the world who compete to be the first to solve a time-consuming math puzzle. \nThe winner gets to update the blockchain with the latest verified transactions, and is rewarded with a predetermined amount of ETH.  \nThis process happens every 30 seconds (compared to Bitcoin’s approximately 10-minute cadence). As traffic on the network has increased, the limitations of Proof of Work have caused bottlenecks during which fees spike unpredictably.\nEthereum’s founders were aware of Proof of Work’s limitations. So a very different solution was devised for Ethereum 2.0. — one that will ultimately allow the network to efficiently process thousands of Ethereum transactions a second.\nEthereum 2.0 uses a consensus mechanism called Proof of Stake, which is faster, less resource-intensive, and (at least theoretically) more secure. The end result is similar to Proof of Work’s, in that a network participant is chosen to verify the latest transactions, update the blockchain, and earn some ETH. \nRather than requiring a network of miners racing to solve a puzzle, Proof of Stake requires a robust network of participants who are literally invested in the success of the enterprise.\nThese stakeholders are called validators. Instead of contributing processing power as miners do, validators contribute ETH to a “staking pool.” \nThe act of contributing ETH to the pool is called staking. If you choose to stake some of your ETH, you will earn rewards in proportion to the size of your stake.  \n The network selects a winner based on the amount of ETH each validator has in the pool and the length of time they’ve had it there — literally rewarding the most invested participants. \nOnce the winner has validated the latest block of transactions, other validators can attest that the block is accurate. When a threshold number of these attestations have been made, the network updates the blockchain. \nAll participating validators receive a reward in ETH, which is distributed by the network in proportion to each validator’s stake. \nSmart contracts 101\nSmart contracts were first proposed in the 1990s by a computer scientist and lawyer named Nick Szabo. Szabo famously compared a smart contract to a vending machine. Imagine a machine that sells cans of soda for a quarter. If you put a dollar into the machine and select a soda, the machine is hardwired to either produce your drink and 75 cents in change, or (if your choice is sold out) to prompt you to make another selection or get your dollar back. This is an example of a simple smart contract. Just like a soda machine can automate a sale without a human intermediary, smart contracts can automate virtually any kind of exchange.\nHowever you acquire your ETH, you’ll need to understand a few basic concepts. Every address on the Ethereum network is issued a public key and a private key, and you’ll need a wallet to manage your crypto holdings.  \nPublic key: Think of this as the crypto version of an email address. Your Ethereum public key is where people can send you ETH and Ethereum-based tokens like USDC and Dai. You can safely give this out to others.\nPrivate key: Think of this like your password. You should generally avoid giving this out to people. A private key is a long string of letters and numbers. (It can also be in the form of a series of words called a seed phrase.) It’s crucial to keep track of your private keys. If you lose them, you lose your Ether forever. \nWallet: To store and secure your Ether you’ll need a wallet. If you’re just starting out, the easiest option is to make an account via the Coinbase app or coinbase.com — in which case you’ll interact with a “custodial wallet” that stores and secures your private keys for you. As you progress you might want to investigate other wallet options that are built for interacting with decentralized finance (or DeFi) protocols such as Compound (a lending and savings app) or Uniswap (a decentralized exchange that allows you to trade cryptocurrencies).\nThere are a few ways of thinking about the answer to this question. On one level, Ethereum’s value is set by markets like any other asset. People buy it with Bitcoin, dollars, euros, yen, and other currencies 24 hours a day. Depending on demand, the price can fluctuate from day to day. (Ethereum’s value tends to be volatile compared to currencies such as the US dollar or equities like Fortune 500 stocks because it is still an emerging technology.)\nBut why the market prices it the way it does is a much more complicated question. To many investors Ethereum’s value is based on its flexibility as a platform for issuing stablecoins and running DeFi applications — resulting in a growing user base and growing transaction fees. \nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/how-to-secure-crypto",
    "text": "You can dramatically improve your digital security with just a few easy steps\nBy Matt Muller, Head of Security Operations, Coinbase\nAs crypto trading becomes increasingly mainstream, our Security team here at Coinbase has seen cybercriminals getting even more creative and persistent in their attempts to steal assets. While that can sound a little scary at first, the good news is that you can dramatically improve your digital security with just a few easy steps. Not only will this help protect your funds on Coinbase, it can be applied to the rest of your digital life as well!\nWhen someone is able to log into one of your accounts to perform fraudulent activity, this is called an “account takeover”, or “ATO” for short. But how do these fraudsters get into your account in the first place? One common method is called a “SIM-swap.” In a SIM-swap attack, fraudsters will actually contact your wireless carrier pretending to be you, and persuade the customer service agent to redirect your cell service to a different device, by changing the SIM card number associated with your account (hence the name of the attack.) Once they succeed, they are able to receive all calls and SMS messages sent to your phone number — including any two-factor authentication codes sent to you via SMS. From there, fraudsters will frequently pair those SMS 2FA codes with stolen passwords to try and log into your email account, social media profiles, cloud storage accounts like Dropbox, or financial accounts like Coinbase.\nAt Coinbase, we do a lot of work behind the scenes to detect and try to stop SIM-swap ATOs targeting our customers’ accounts. We also believe that using SMS-based two-factor authentication (2FA) is better than using no 2FA at all. That said, we encourage everyone to follow the two simple steps below and apply them to all the accounts they care about — not just their Coinbase accounts.\nYour passwords should be at least 16 characters, extremely complex and unique for your accounts. That’s hard to do by yourself, but password managers like 1Password or Dashlane can be used to create and remember your passwords.\nAre you currently using a password that has been exposed in a third-party data breach somewhere? You can check to see if you’re using a risky password by visiting haveibeenpwned.com/Passwords.\nIn addition to strong passwords, where available, use two-factor authentication (2FA). And always use the strongest type of 2FA the platform allows, ideally a Yubikey or similar hardware security key.\nIf a service provider doesn’t allow Yubikey, use an authentication app like Google Authenticator or Duo Security instead of SMS-based 2FA if possible.\nIf SMS-based 2FA is the only thing available, at the very least require a one-time 2FA code to be sent to your device every time you login — so someone can’t access your account if they have stolen your password.\nIf an organization doesn’t offer any of these options, consider not using that service.\nIt’s not only important to play defense with the right security tools when protecting your accounts, but it’s also important to stay vigilant in the wild. Some guidelines:\nDon’t make yourself a target\nDon’t brag about your cryptocurrency holdings online, just like you wouldn’t advertise inheriting $50 million.\nReview your online presence with this easy self-assessment.\nDon’t fall for tricks\nHackers posing as tech support — even bad actors posing as Coinbase customer support specifically — may pressure you for account credentials. Coinbase will never ask you for passwords, 2FA codes, PIN numbers or for remote access to your computer.\nCoinbase will never ask you to create test accounts on other platforms or provide your ID or banking information over email or social media. We do not offer Facebook support chat and we will never call you by phone.\nIf someone reaches out to you and you’re not sure if it’s a scam, you can reach out to security@coinbase.com to confirm whether it’s legitimate. And remember, Microsoft, Google, and Apple will never call you about your computer.\nCheck the URL\nScammers create fake sites that look like real exchanges but are designed to steal account information. Double check the web address before you login into your account or input any of your credentials.\nIf we emailed you and include a link, copy the link and paste it into a text editor before entering it into your browser to make sure you know where the link is really taking you.\nWhile Coinbase has gone to great lengths to secure our environment, it’s important that everyone understands their role in maintaining the security chain. By following some basic security steps, you can make sure your crypto stays safe. To learn more, visit our Help Center.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/understanding-crypto-taxes",
    "text": "How is crypto taxed in the U.S.? Your guide to this tax season\nU.S. taxpayers are required to report crypto sales, conversions, payments, and income to the IRS, and state tax authorities where applicable, and each of these transactions has different tax implications. In this article, you'll learn when your crypto is taxed and how your activity might affect your taxes. Let's dive in.\nA quick note before we start…\nCoinbase doesn’t provide tax advice. This article represents our stance on IRS guidance received to date, which may continue to evolve and change. None of this should be considered as advice or an individualized recommendation, but it’s important to us that our customers have relevant information available to them in the most accessible way possible. Please consult a tax professional regarding your own tax circumstances.\nIn the U.S., crypto is considered a digital asset, and the IRS treats it generally like stocks, bonds, and other capital assets. Like these assets, the money you gain from crypto is taxed at different rates, either as capital gains or as income, depending on how you got your crypto and how long you held on to it.\nTo understand if you owe taxes, it’s important to look at how you used your crypto. Transactions that result in a tax are called taxable events. Those that don’t are called non-taxable events. Let’s break them down: \nNot taxable \nBuying crypto with cash and holding it: Just buying and owning crypto isn’t taxable on its own. The tax is often incurred later on when you sell, and its gains are “realized.” \nDonating crypto to a qualified tax-exempt charity or non-profit: If you give crypto directly to a 501(c)(3) charitable organization, like GiveCrypto.org, you may be able to claim a charitable deduction.\nReceiving a gift: If you’re lucky enough to get crypto as a gift, you’re not likely to incur a tax until you sell or participate in another taxable activity like staking.\nGiving a gift: How thoughtful! You can gift up to $18,000 per recipient per year without paying taxes (and higher amounts to spouses) for 2024 and $19,000 per recipient for 2025. If your gift exceeds these limits, you’ll need to file a gift tax return (which generally does not result in any current tax liability). If you transfer crypto to someone else outside of a purchase for goods or services, it may count as a gift, even if you didn’t mean it that way.  \nTransferring crypto to yourself: Transferring crypto between wallets or accounts you own isn’t taxable. You can transfer over your original cost basis and date acquired to continue tracking your potential tax impact for when you eventually sell.\nTaxable as capital gains\nSelling crypto for cash: Did you sell your crypto for U.S. dollars? You’ll owe taxes if you sell your assets for more than you paid for them. If you sell at a loss, you may be able to deduct that loss on your taxes.\nConverting one crypto to another: When you use bitcoin to buy ether, for example, you technically have to sell your bitcoin before you buy a new asset. Because this is a sale, the IRS considers it taxable. You’ll owe taxes if you sold your bitcoin for more than you paid for it.\nSpending crypto on goods and services: If you use bitcoin to buy a pizza, for example, you’ll likely owe taxes on the transaction. To the IRS, spending crypto isn’t that much different from selling it. You need to sell the asset before it can be exchanged for a good or service, and selling crypto makes it subject to capital gains taxes. \nTaxable as income\nGetting paid in crypto: If you were paid in crypto by an employer, your crypto will be taxed as compensation according to your income tax bracket.\nGetting crypto in exchange for goods or services:  If you accept crypto in payment for a good or service, you’re responsible for reporting it as income to the IRS.\nMining crypto: If you mined crypto, you’ll likely owe taxes on your earnings based on the fair market value (often the price) of the mined coins at the time they were received. Crypto mined as a business is taxed as self-employment income.\nEarning staking rewards: Staking rewards are treated like mining proceeds: taxes are based on the fair market value of your rewards on the day you received them. Special note on staked ETH: Income earned on staked ETH will be considered taxable income at the time Coinbase customers are able to unstake (regardless of whether the user chooses to unstake or continue to stake), and therefore gain control over those rewards.\nEarning other income: You might earn rewards by holding certain cryptocurrencies such as USD Coin. This is considered taxable income. Additionally, simply holding cbETH introduces taxable income. \nGetting crypto from a hard fork: Taxes on crypto you got from a hard fork depend on how you use the asset, when it’s available to withdraw from your exchange, and more. See the latest IRS guidance on hard forks\nGetting an airdrop: You might receive airdrops from a crypto company as part of a marketing campaign or giveaway. Getting an airdrop is taxable as income, and you’ll need to report the amount in your taxes. See the latest IRS guidance on airdrops\nReceiving other incentives or rewards: This list isn’t comprehensive — there are a variety of reasons why you might receive free crypto. These can include rewards from learning rewards or incentives like getting $5 in bitcoin for referring a friend to a crypto exchange. Regardless, you’ll need to report these as income.\nGood news for hodlers\nIf you’re holding crypto, there’s no immediate gain or loss, so the crypto is not taxed. Tax is only incurred when you sell the asset, and you subsequently receive either cash or units of another cryptocurrency: At this point, you have “realized” the gains,  and you have a taxable event. \nSo it looks like some of your crypto activity is taxable — what now? You can estimate how much you’ll owe in taxes by calculating your income, gains, and losses. Here’s what that means:\nCalculating crypto income\nIf you’re a U.S. taxpayer, you’re probably used to seeing your federal and state income tax deducted from your pay stubs. The crypto you receive as income (like mining, staking, and rewards) is also subject to these same income taxes, which often won't be deducted or withheld. When you report your earnings, you’ll generally owe according to the income tax rate appropriate to your tax bracket. Word of caution: If you’ve earned a lot from crypto activity, it might affect what tax bracket you’re in and you may end up paying a higher tax rate on some of your earnings.\nVisit IRS.gov for the latest guidance on federal income taxes.\nCalculating capital gains and losses\nTo calculate the amount you gained or lost, you’ll first need to know how much crypto you started with. This is called your cost basis.\nKnowing your cost basis\nWhen you buy cryptocurrency, your cost basis is generally determined by how much you paid for it. However, if you received crypto from mining or staking, your cost basis is determined by the fair market value when you received it. Your cost basis for gifted crypto will depend on both the basis the person who transferred it to you had and the fair market value when you received it. \nWhen you sell your crypto, you can subtract your cost basis from your sale price in order to figure out whether you have a capital gain or capital loss. If your proceeds exceed your cost basis, you have a capital gain. If not, you have a capital loss. \nShort-term vs. long-term capital gains\nCapital gains taxes are applied at both the federal and state (where applicable) level. They can be long-term or short-term, and how long you’ve held your crypto affects how much tax you’ll end up owing. If you held onto your crypto for more than a year before selling, you'll generally pay a lower rate than if you sold right away.\nLong-term gains are taxed at a reduced capital gains rate. These rates (0%, 15%, or 20% at the federal level) vary based on your income. Higher income taxpayers may also be subject to the 3.8% Net Investment Income Tax on their gains or other income. \nShort-term gains are taxed at your ordinary income rate, which is usually a higher, less-favorable rate.\nRemember, taxable events happen when you realize losses or gains, meaning you’ve sold your crypto by either selling for cash, converting to another crypto, or spending it on a good or service. The gains are unrealized if you still own the original shares. \nUnderstanding your capital losses\nYou’ve realized a capital loss when you sold an asset for less than you paid for it. Losses can work to your advantage, though. You can use losses to offset other capital gains (including from non-crypto assets, like stocks) you may have had during the year on a dollar-for-dollar basis, potentially reducing your overall tax bill. \nIf you have more losses than gains or have no gains at all, the maximum amount of losses that you can declare each year to offset other income is $3,000. Any remainder carries over to subsequent years until the full amount of the loss is applied. \nCoinbase Gain/Loss Report\nCoinbase customers will be able to generate a Gain/Loss Report that details capital gains or losses using the cost basis specification strategy in their tax center settings: customers can choose between a HIFO (highest in, first out), LIFO (last in, first out), and FIFO (first in, first out). The report will only have information about activity on Coinbase. It won’t have information about crypto-related transactions outside of Coinbase. It’s important to review and verify the information for accuracy before you use it to file. The tool should not be used as official tax documentation. For more on Coinbase Reports and IRS forms, read our article: Tax forms, explained.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-crypto-airdrop",
    "text": "A crypto airdrop is a strategy used by blockchain startups to distribute tokens or coins to specific wallet addresses.\nAirdrops strive to raise awareness and adoption of new blockchain projects.\nThere are different types of airdrops, and they may require participants to perform certain tasks or hold a certain amount of existing tokens.\nA crypto airdrop is an activity typically performed by blockchain-based startups to help bootstrap a virtual currency project. Its aim is to spread awareness about the cryptocurrency project and to encourage more people to participate in it when it becomes available. Airdrops are generally communicated through the company's official channels and cryptocurrency communities. Coins or tokens are sent only to specific wallets based on the blockchain network or coins held in existing wallets.\nTo qualify for the tokens or coins, a recipient may need to hold a minimum quantity of the crypto coins in their wallet. Alternatively, they may need to perform a certain task, such as discussing the currency on a forum, connecting with a particular member of the blockchain project, or writing a blog post.\nThere are several types of crypto airdrops, each with its own set of requirements and goals.\nStandard Airdrop: Participants interested in receiving an airdrop simply express their interest in order to receive the airdrop. The individual must provide a valid wallet address, and some airdrops require no additional information beyond this.\nBounty Airdrop: Bounty crypto airdrops occur when users perform certain tasks. These tasks often entail raising awareness of a project through various channels.\nHolder Airdrop: This type of airdrop requires participants to hold a certain amount of the existing coins or tokens in their wallets to qualify for the tokens. The amount of tokens received may depend on the amount and duration of holding the existing coins or tokens.\nExclusive Airdrop: This type of airdrop requires participants to be selected or invited by the project team or partners to receive the tokens. The selection criteria may be based on reputation, influence, expertise, contribution, etc.\nA crypto airdrop usually involves the following steps:\nThe project team communicates the details and requirements of the airdrop through their official channels or cryptocurrency communities.\nThe interested participants register for the airdrop by providing their wallet address and other information or performing the required tasks.\nThe project team verifies the eligibility and validity of the participants and distributes the tokens to their wallets according to the rules of the airdrop.\nThe participants receive the tokens in their wallets and can use them according to the terms and conditions of the project.\nCrypto airdrops can be a source of compensation for cryptocurrency enthusiasts who participate in them. There are several ways to receive compensation through crypto airdrops, such as:\nSelling: One way to receive compensation through crypto airdrops is to sell the tokens once they become available. Depending on the demand and supply of the tokens, their value may increase or decrease over time.\nHolding: Another way to receive compensation through crypto airdrops is to hold the tokens for long-term appreciation. If the project behind the tokens is successful and valuable, their value may increase significantly over time.\nDespite their popularity, however, crypto airdrops aren’t always as risk-free as they seem. Because recipients receive tokens or coins in their wallets, there will be airdrops that are nothing more than pump-and-dump schemes. More specifically, the creator issues a token and hopes there will be enough hype surrounding it to have it listed on an exchange. Once tokens begin trading, the creator sells their sizeable portion of tokens, crashing the price. Therefore, it's crucial to do your due diligence before participating in a crypto airdrop.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-are-ethereum-layer-2-blockchains-and-how-do-they-work",
    "text": "TL;DR: Ethereum Layer-2 blockchains are solutions designed to enhance the scalability of the Ethereum network. They operate on top of the Ethereum blockchain (Layer-1), inheriting its security while striving to provide faster and less costly transactions. Common types of Layer-2 solutions include rollups and sidechains.\nEthereum, conceptualized by Vitalik Buterin in 2013 and launched in 2015, is a decentralized network that maintains a shared database capable of executing smart contracts. These self-executing agreements have paved the way for decentralized applications (dApps), resulting in increased use of Ethereum. However, this growth has also highlighted scalability issues, such as high transaction fees, network congestion, and slow transaction times during periods of high network activity.\nLayer-2 refers to any off-chain network, system, or technology built on top of a blockchain (commonly known as a Layer-1 network) that strives to extend the capabilities of the underlying base layer network. Layer-2 solutions inherit the security of the blockchain they are built on top of, with transaction data verified and confirmed by the underlying blockchain network. They strive to increase transaction throughput, with the intention of reducing fees, without compromising on decentralization or security.\nThe blockchain scalability trilemma posits that blockchains are incapable of scaling effectively while keeping the underlying network both secure and decentralized. Instead, there must be tradeoffs between these three features. Layer-2 solutions are built on the premise that this scalability limitation exists because blockchains are tasked with too many things. By sharing the burden of transaction processing, Layer-2 solutions are designed to address these scalability issues.\nCommon types of Layer-2 solutions on Ethereum include optimistic rollups and Zero-Knowledge rollups (ZK rollups). Optimistic rollups and ZK rollups are considered secure, as they inherit the Ethereum mainnet’s security. The Ethereum Virtual Machine (EVM) compatibility of optimistic rollups makes it convenient for developers to migrate existing smart contracts from Ethereum to optimistic rollup blockchains. Zero-knowledge Ethereum Virtual Machines (zkEVMs) can provide the scalability benefits of both zero-knowledge proofs and EVM compatibility.\nLayer-2 solutions are considered a component in the future scalability of Ethereum. By providing a faster, less costly route for executing Ethereum transactions, they are designed to address the current issues of high transaction fees and network congestion. As the Ethereum ecosystem continues to grow and evolve, the role of Layer-2 solutions may become more prominent.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-are-digital-assets",
    "text": "Digital assets are anything created and stored digitally that has or provides value.\nThey include a wide range of items from photos, documents, and videos to cryptocurrencies and tokenized assets.\nDigital assets have become increasingly important as technology integrates more into our personal and professional lives.\nA digital asset is anything that is created and stored digitally, is identifiable and discoverable, and has or provides value. This broad definition encompasses a wide range of items, from photos, documents, and videos to more complex forms such as cryptocurrencies and tokenized assets.\nDigital assets have become increasingly important as technology integrates more into our personal and professional lives. They can be assigned a value—monetary or intangible. Some digital items might only be valuable to the creator or one person, such as a family picture on your phone taken at a gathering. Others could be valuable to a much wider audience.\nDigital assets have evolved into more than just words, pictures, videos, audio, and documents. With the introduction of Bitcoin in 2009, the concept of blockchain—a distributed public ledger secured by a consensus mechanism—was brought into the limelight. This technology aims to facilitate the creation of new types of digital assets, such as cryptocurrencies and tokenized assets.\nFor a digital asset to be considered an asset, it must first have the potential to create value in that it can be used in a manner that generates value for the owner. The digital asset should then be able to transfer ownership through acquisition, gifting, or other means of giving the rights to someone else, along with the value the item can bring. It must also be discoverable or stored somewhere that it can be found.\nThere are many different types of digital assets. Traditional forms include photos, documents, videos, books, audio/music, animations, illustrations, manuscripts, emails and email accounts, logos, metadata, content, and gaming accounts.\nNewer digital assets are based on blockchain or similar technologies. These include non-fungible tokens (NFTs), cryptocurrencies, tokens, crypto assets, tokenized assets, security tokens, and central bank digital currencies.\nDigital assets have become an integral part of our lives. We turn to digitally hosted information for learning, store our photos and important documents in digital form, and even use digital assets like cryptocurrencies for transactions. Businesses and governments also store and manage data and information, all of which have different values depending on how they can be used.\nDigital assets have a profound impact on our daily lives. For instance, you might wake up one morning and acquire a sports video token of your favorite running back's winning touchdown. At work, you might use a cryptocurrency to acquire sales data to analyze a specific market and send a digital presentation of your findings to your boss. On your way home, you might capture a once-in-a-lifetime video on your phone and transfer it as an NFT. These examples illustrate how digital assets have become a part of our everyday activities.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/forex-trading-vs-crypto-which-is-right-for-you",
    "text": "Forex and crypto trading are both popular financial options with their unique advantages and risks.\nForex trading involves trading fiat currency pairings, while crypto trading involves trading digital currencies.\nYour choice between forex and crypto trading should be based on your financial goals, risk tolerance, and understanding of each market.\nForex trading, short for foreign exchange trading, involves the trading of different currencies on the foreign exchange market. It operates 24 hours a day during weekdays, with trading sessions in major financial hubs such as London, New York, Tokyo, and Sydney. Traders make predictions about the strength or weakness of one currency relative to another and base their choices on analysis (fundamental, technical, and sentiment).\nForex trading is known for its notable level of liquidity, meaning there is a substantial amount of trading activity and trading volume. This notable liquidity allows traders to easily enter and exit positions without significantly impacting the market price. However, forex trading also involves the use of leverage, which can boost profits but also raises the possibility of considerable losses. Therefore, risk management is crucial in forex trading.\nCrypto trading involves the trading of digital currencies like Bitcoin, Ethereum, and Litecoin on a decentralized platform. Unlike traditional currencies, cryptos are not backed by any government or financial institution and their value is determined solely by supply and demand on the market.\nCrypto trading is known for its potential for notable returns due to the extreme volatility of the cryptocurrency market. This volatility can present excellent opportunities for considerable gains for savvy traders. The crypto markets never close, offering unmatched accessibility for traders. However, the notable volatility of the cryptocurrency market can also pose a considerable risk, and traders must exercise caution and proper risk management.\nWhile both forex and crypto trading involve trading currencies, there are key differences between the two.\nForex trading involves trading fiat currency pairings and is regulated by financial institutions and governments. On the other hand, crypto trading involves trading digital currencies in a decentralized and unregulated environment.\nThe forex market is known for its notable liquidity and stability, while the crypto market is known for its notable volatility and potential for considerable returns. However, this notable volatility also comes with considerable risk.\nIn terms of accessibility, the forex market operates 24 hours a day during weekdays, while the crypto market operates 24/7, offering unmatched accessibility for traders.\nYour choice between forex and crypto trading should be based on your financial goals, risk tolerance, and understanding of each market.\nIf you prefer a more stable and regulated environment, forex trading may be more suitable for you. However, if you are willing to take on more risk for the potential of higher returns and prefer a more flexible and accessible trading environment, crypto trading may be a better fit.\nRemember, both forex and crypto trading involve considerable risk, and it is crucial to have a solid understanding of the market and to exercise proper risk management. Always do your own research and consider seeking advice from a financial advisor before making any financial decisions.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-nft-art",
    "text": "We use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-dollar-cost-averaging-dca",
    "text": "Dollar-Cost Averaging (DCA) is a strategy that involves allocating a fixed amount of resources to a particular asset at regular intervals, regardless of its price.\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-are-decentralized-autonomous-organizations",
    "text": "Decentralized Autonomous Organizations (DAOs) are entities with no central leadership, governed by a community organized around a specific set of rules enforced on a blockchain.\nDAOs operate using smart contracts, which are chunks of code that automatically execute whenever a set of criteria are met.\nDAOs are fully autonomous and transparent, built on open-source blockchains, allowing anyone to view their code and audit their built-in treasuries.\nA Decentralized Autonomous Organization (DAO) is an entity that operates without a central authority. Instead, it is governed by a community that shares a common goal and operates based on a specific set of rules enforced on a blockchain. DAOs are internet-native organizations collectively owned and managed by their members. They have built-in treasuries that are only accessible with the approval of their members. Decisions are made via proposals the group votes on during a specified period.\nDAOs operate using smart contracts, which are essentially chunks of code that automatically execute whenever a set of criteria are met. These smart contracts establish the DAO’s rules. Those with a stake in a DAO then get voting rights and may influence how the organization operates by deciding on or creating new governance proposals. This model prevents DAOs from being spammed with proposals: A proposal will only pass once the majority of stakeholders approve it. How that majority is determined varies from DAO to DAO and is specified in the smart contracts.\nThere are several reasons why an entity or collective group of individuals may want to pursue a DAO structure. Some of the potential advantages of this form of management include decentralization. Decisions impacting the organization are made by a collection of individuals as opposed to a central authority. This eliminates the need for third-party facilitators and has the potential to enhance the cryptocurrency space by promoting transparency and autonomy.\nWhile DAOs offer numerous potential benefits, they also come with their own set of challenges. One of the major limitations is security. DAOs must ensure security is prioritized, as exploits can leave a DAO drained of a large amount of its treasury savings. Moreover, the accumulation of voting rights tokens may lead to a concentration of power, which could potentially undermine the decentralized nature of the organization.\nOne of the first DAOs named The DAO was an organization created by developers to automate decisions and facilitate cryptocurrency transactions. However, it was exploited and drained of a large amount of cryptocurrency. Despite this setback, the incident led to notable improvements in the security and operation of subsequent DAOs. Another example is ConstitutionDAO, which was formed in an attempt to acquire a copy of the U.S. Constitution. Though the DAO did not succeed in acquiring the asset, it demonstrated that a collection of like-minded individuals could form and pursue such endeavors.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-memecoin",
    "text": "Memecoins are cryptocurrencies often inspired by internet memes or trends.\nThey are typically characterized by their volatile nature.\nDespite their inherent risk, memecoins have gained visibility due to the possibility of high returns and their role in digital culture.\nMemecoins are a type of cryptocurrency that are often inspired by internet memes, characters, or trends. They are typically supported by enthusiastic online communities and are generally intended to be light-hearted and fun. Examples of memecoins include Dogecoin, Shiba Inu, and others that are often associated with entertainment rather than usability.\nMemecoins are a genre of cryptocurrency that is loosely defined by an exuberant online community supporting the currency's growth. They are sometimes identified with animated characters or animal meme images. Currencies that have gained memecoin status include Dogecoin and Shiba Inu, among others. As with other cryptocurrencies, memecoins rely on blockchain technology, a type of distributed database used to track virtual assets. Most memecoins are purely trading instruments, unlike Ethereum and other utility currencies tied to specific blockchain features.\nMemecoins are considered risky and volatile trading assets. On other occasions, they might only be meant as a joke but somehow gain followers and individuals interested in the token. If you find distinguishing between memecoins, scams, and cryptocurrency confusing, you're not alone. It's critical to understand the risks to help you avoid unexpected volatility and losses.\nMemecoins have increased in visibility in recent years. This is largely due to endorsements from high-profile individuals and the role of memecoins in digital culture. Despite their risky nature, memecoins have gained attention from traders due to the possibility of high returns. Engaging with memecoins carries risk and is something you should only attempt armed with research and experience.\nSome countries have taken steps to regulate memecoins. This highlights the importance of understanding the regulatory landscape of memecoins in your respective country before engaging in any trading activities.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/proof-of-work-pow-vs-proof-of-stake-pos-what-is-the-difference",
    "text": "We use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/how-to-set-up-a-crypto-wallet",
    "text": "New to crypto? Not for long — start with these guides and explainers\nBitcoin is the world's first widely adopted cryptocurrency — it allows for secure and seamless peer-to-peer transactions on the internet.\nBitcoin, Ethereum, and other crypto are revolutionizing how we invest, bank, and use money. Learn more in this beginner's guide.\nEthereum is the second-biggest cryptocurrency by market cap after Bitcoin. It is also a decentralized computing platform that can run a wide variety of applications — including the...\nCryptocurrencies like Bitcoin and Ethereum are powered by a technology called the blockchain.\nYou can dramatically improve your digital security with just a few easy steps\nNot sure if you owe taxes on your crypto? Learn how using crypto this year can affect your U.S. taxes.\nLook at some of the biggest myths and misconceptions people tend to have about the world’s...\nFrom diamond hands to the flippening, we break down 11 of the most popular pieces of crypt...\nA crypto airdrop is a strategy used by blockchain startups to distribute tokens or coins t...\nGas fees are transaction costs on the Ethereum blockchain, paid in Ether (ETH) or its frac...\nTL;DR: Ethereum Layer-2 blockchains are solutions designed to enhance the scalability of t...\nStablecoins are a type of cryptocurrency whose value is pegged to another asset, such as a...\nForex and crypto trading are both popular financial options with their unique advantages a...\nDigital assets are anything created and stored digitally that has or provides value. They...\nNFT art refers to digital assets stored on a blockchain that represent content or physical...\nCryptocurrency mining is a process that validates transactions and adds them to a blockcha...\nCoins are digital assets that operate on their own independent blockchain. Tokens are digi...\nBitcoin and Ethereum are both digital assets, but they aim to serve different purposes and...\nAPY and APR are two key metrics used to measure compensation from crypto activities. Thoug...\nSpot trading in crypto refers to the process of buying and selling digital currencies at t...\nDollar-Cost Averaging (DCA) is a strategy that involves allocating a fixed amount of resou...\nDecentralized Autonomous Organizations (DAOs) are entities with no central leadership, gov...\nMemecoins are cryptocurrencies often inspired by internet memes or trends. They are typica...\nPoW and PoS are consensus mechanisms used in cryptocurrency networks to validate transacti...\nDecentralized Applications (DApps) are applications that run on blockchain networks, striv...\nMining is the process that Bitcoin and several other cryptocurrencies use to mint new coin...\nCrypto whales are individuals or entities that hold large amounts of cryptocurrency. They...\nNFT rarity ranking is associated with the uniqueness or scarcity of a nonfungible token in...\nGovernance tokens are a type of cryptocurrency that allows holders to participate in on-ch...\nBlockchain network congestion happens when the quantity of transactions surpasses the netw...\nCardano is one of the biggest cryptocurrencies by market cap. It’s designed to a flexible,...\nLearn how to earn interest on your savings or take out a loan using crypto as collateral\nCryptography is the study and practice of sending secure and encrypted messages between tw...\nMarkets experiencing sustained and/or substantial growth are called bull markets. Markets...\nA fork happens whenever a community makes a change to the blockchain’s protocol, or basic...\nInflation is the process by which a currency like the dollar or Euro loses value over time...\nDOGE was created as a lighthearted alternative to traditional cryptocurrencies, but it's b...\nMarket capitalization is the total value of all the coins that have been mined.\nA beginner's guide to the Polkadot protocol\nA beginner's guide to the Polygon network\nTechnically, “token” is just another word for “cryptocurrency” or “cryptoasset.” But incre...\nExchange-traded funds — better known as an ETFs — are similar in many ways to mutual fund...\nOur guide to the best and smartest crypto articles, podcasts, and YouTube videos.\nFiat on-ramps and off-ramps are services that facilitate the exchange of fiat currencies f...\nGenerative art NFTs are unique digital artworks created through a blend of human creativit...\nThis article provides a glossary of terms related to Non-Fungible Tokens (NFTs). It covers...\nDecentralized Autonomous Organizations (DAOs) are entities that pool and allocate resource...\nSocial tokens are digital assets issued by creators to monetize their content and engage w...\nNFT sniping is the practice of swiftly identifying and acquiring newly listed or undervalu...\nNFT Fashion refers to the creation and distribution of unique digital fashion items on the...\nToken gating is a method that Web3 communities use to provide token holders with access to...\nNFTs present unique ownership and potential for royalties, but they also come with risks s...\nUtility tokens provide access to a product or service within a specific blockchain ecosyst...\nAudius is a decentralized music streaming platform that aims to provide a more equitable m...\nVirtual real estate refers to digital properties in the metaverse, which can be acquired,...\nBlockchain technology aims to increase transparency and trust in the supply chain industry...\nBitcoin block reward, block size, and block time are integral aspects of Bitcoin's blockch...\nFractional NFTs allow for shared ownership of a single, unique NFT, making it more accessi...\nFarcaster is a protocol that facilitates the creation and connection of social media apps....\nStablecoins are digital assets designed to maintain a stable value, often linked to a spec...\nEthereum and Ethereum Classic are two separate blockchains that originated from the same p...\nThe Bitcoin whitepaper, published in 2008 by an anonymous entity known as Satoshi Nakamoto...\nThe rise of cryptocurrencies is driven by the need for decentralized finance, the potentia...\nQuantum computing, a technology in development, could potentially affect the security of c...\nCrypto points farming is a trend where users receive points for interacting with certain b...\nCrypto wallets store your private keys and keep your crypto safe and accessible for spendi...\nEthereum Pectra Upgrade: More scalability, lower fees & enhanced security. Discover the ke...\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-tips/what-is-staking",
    "text": "Beginner guides, practical tips, and market updates for first-timers, experienced investors, and everyone in between\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/tips-and-tutorials/how-to-read-crypto-charts",
    "text": "Get practical, step-by-step answers to all things crypto\nQuick-start guide to nabbing the digital collectible of your dreams\nFrom diamond hands to the flippening, we break down 11 of the most popular pieces of crypto lingo\nLearn how to setup and get started with a crypto wallet.\nFrom staking to lending, five of the best ways to grow your crypto\nTL;DR: Initial Coin Offerings (ICOs) are a method of gathering resources for cryptocurrenc...\nThe Ethereum upgrade seeks to enhance scalability, security, and efficiency within the Eth...\nA crypto whitelist is a list of approved participants for a specific event in the cryptocu...\nNFTs aim to provide true ownership of in-game assets, enabling gamers to sell, monetize, a...\nOptimistic Rollups and ZK-Rollups are both Layer 2 scaling solutions for Ethereum, with th...\nFan tokens are digital assets that provide holders with access to exclusive content, votin...\nThe creation of a cryptocurrency involves understanding blockchain technology, consensus m...\nAI aims to enhance crypto trading by automating transactions, predicting market trends, an...\nTL;DR: ROA, or Return on Allocation, is a ratio that compares the gain or loss from an ass...\nOn-chain transactions occur directly on the blockchain, providing a level of security and...\nParaFi Capital managing partner Ben Forman breaks down some key DeFi concepts\nIn this edition of Expert Tips, we speak to Scalar Capital founder Linda Xie.\nLearn how to send crypto to another wallet — to a friend, family member, or store.\nWhen prices are fluctuating, how do you know when to buy? Learn more about using dollar-co...\nWhen researching assets, you may run into a special form of price graph called candlestic...\nBitcoin, ETH, and other cryptocurrencies can make your giving go farther. Plus: 15 nonprof...\nLongtime trader Ray Tong shares practical advice for both new and experienced investors.\nOver the last few years, Bitcoin and other cryptocurrencies have fast emerged as a truly m...\nHow to minimize your losses (and even make savvy moves) during a falling market\nThe process of gifting an NFT involves three main steps: obtaining the recipient's wallet...\nA crypto dusting attack involves sending small quantities of cryptocurrency, known as dust...\nBacktesting is a key step in developing a crypto trading strategy, offering insights into...\nSecuring an entry-level job in crypto necessitates a grasp of crypto fundamentals, acquiri...\nA rug pull is a scenario in the cryptocurrency world where developers abandon a project af...\nNFT swap order scams involve deceiving individuals into exchanging valuable NFTs for ones...\nSmart contract functions are integral to blockchain interactions, but they can be manipula...\nSmart contracts are autonomous digital agreements that play a pivotal role in cryptocurren...\nBitcoin ATMs, or BTMs, are physical kiosks that facilitate transactions of Bitcoin in exch...\nCryptocurrencies utilize blockchain technology, which aims to be secure and resistant to h...\nIt's crucial to plan for the transfer of your crypto assets after death to prevent potenti...\nBitcoin Name Service (BNS) is a decentralized naming database that provides human-readable...\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/tips-and-tutorials/what-is-defi",
    "text": "Get practical, step-by-step answers to all things crypto\nQuick-start guide to nabbing the digital collectible of your dreams\nFrom diamond hands to the flippening, we break down 11 of the most popular pieces of crypto lingo\nLearn how to setup and get started with a crypto wallet.\nFrom staking to lending, five of the best ways to grow your crypto\nTL;DR: Initial Coin Offerings (ICOs) are a method of gathering resources for cryptocurrenc...\nThe Ethereum upgrade seeks to enhance scalability, security, and efficiency within the Eth...\nA crypto whitelist is a list of approved participants for a specific event in the cryptocu...\nNFTs aim to provide true ownership of in-game assets, enabling gamers to sell, monetize, a...\nOptimistic Rollups and ZK-Rollups are both Layer 2 scaling solutions for Ethereum, with th...\nFan tokens are digital assets that provide holders with access to exclusive content, votin...\nThe creation of a cryptocurrency involves understanding blockchain technology, consensus m...\nAI aims to enhance crypto trading by automating transactions, predicting market trends, an...\nTL;DR: ROA, or Return on Allocation, is a ratio that compares the gain or loss from an ass...\nOn-chain transactions occur directly on the blockchain, providing a level of security and...\nParaFi Capital managing partner Ben Forman breaks down some key DeFi concepts\nIn this edition of Expert Tips, we speak to Scalar Capital founder Linda Xie.\nLearn how to send crypto to another wallet — to a friend, family member, or store.\nWhen prices are fluctuating, how do you know when to buy? Learn more about using dollar-co...\nWhen researching assets, you may run into a special form of price graph called candlestic...\nBitcoin, ETH, and other cryptocurrencies can make your giving go farther. Plus: 15 nonprof...\nLongtime trader Ray Tong shares practical advice for both new and experienced investors.\nOver the last few years, Bitcoin and other cryptocurrencies have fast emerged as a truly m...\nHow to minimize your losses (and even make savvy moves) during a falling market\nThe process of gifting an NFT involves three main steps: obtaining the recipient's wallet...\nA crypto dusting attack involves sending small quantities of cryptocurrency, known as dust...\nBacktesting is a key step in developing a crypto trading strategy, offering insights into...\nSecuring an entry-level job in crypto necessitates a grasp of crypto fundamentals, acquiri...\nA rug pull is a scenario in the cryptocurrency world where developers abandon a project af...\nNFT swap order scams involve deceiving individuals into exchanging valuable NFTs for ones...\nSmart contract functions are integral to blockchain interactions, but they can be manipula...\nSmart contracts are autonomous digital agreements that play a pivotal role in cryptocurren...\nBitcoin ATMs, or BTMs, are physical kiosks that facilitate transactions of Bitcoin in exch...\nCryptocurrencies utilize blockchain technology, which aims to be secure and resistant to h...\nIt's crucial to plan for the transfer of your crypto assets after death to prevent potenti...\nBitcoin Name Service (BNS) is a decentralized naming database that provides human-readable...\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-are-nfts",
    "text": "Definition\nNFTs (or “non-fungible tokens”) are a special kind of cryptoasset in which each token is unique — as opposed to “fungible” assets like Bitcoin and dollar bills, which are all worth exactly the same amount. Because every NFT is unique, they can be used to authenticate ownership of digital assets like artworks, recordings, and virtual real estate or pets.\nIn February 2021, a 10-second video by an artist named Beeple sold online for $6.6 million. Around the same time, Christie’s announced that it would be selling a collage of 5,000 “all-digital” works by the Wisconsin-based artist, whose real name is Mike Winkelmann. It was put on a virtual auction block with a starting price of $100 — and on March 11 it sold for a staggering $69 million. \nBeyond the high prices, there was one other fact that observers found fascinating. In exchange for their money, collectors who buy Beeples don’t receive any physical manifestation of the artwork. Not even a framed print. What they do get is an increasingly popular kind of cryptoasset called an NFT — short for non-fungible token. \nEach Beeple piece is paired with a unique NFT — a token attesting that each owner’s version is the real one. “We are in a very unknown territory,” Christie’s contemporary art specialist Noah Davis told Reuters. “In the first 10 minutes of bidding we had more than a hundred bids from 21 bidders and we were at a million dollars.”\nYou can think of NFTs as being kind of like certificates of authenticity for digital artifacts. They’re currently being used to sell a huge range of virtual collectibles, including:\nNBA virtual trading cards \nMusic and video clips from EDM stars like Deadmau5\nVideo art by Grimes\nThe original “nyan cat” meme \nA tweet by Dallas Mavericks owner and entrepreneur Mark Cuban \nVirtual real estate in a place called Decentraland  \nAs Bitcoin and other crypto has boomed in popularity over the last year, NFTs have also soared — growing to an estimated $338 million in 2020. Each NFT is stored on an open blockchain (often Ethereum’s) and anyone interested can track them as they’re created, sold, and resold. Because they use smart contract technology, NFTs can be set up so that the original artist continues to earn a percentage of all subsequent sales. \nAlong the way, NFTs have raised fascinating philosophical questions about the nature of ownership. Wondering why digital artifacts that can be endlessly copied and pasted have any value at all? Proponents would point out that most kinds of collecting isn’t based on inherent value. Old comic books were produced for pennies’ worth of ink and paper. Rare sneakers are often made out of the same materials as worthless ones. Some paintings hang in the Louvre, others end up in thrift shops. \nAs the collector who sold the $6.6 million Beeple piece noted, you can take a nice picture of the Mona Lisa, but it’s not the Mona Lisa. “It doesn’t have any value because it doesn’t have the provenance or the history of the work,” said the Beeple fan. “The reality here is that this is very, very valuable because of who is behind it.”\nEvery bitcoin is worth as much as every other bitcoin. NFTs, on the other hand, are all unique. “Fungibility” refers to goods or assets that are all the same and can be swapped interchangeably. A dollar bill is another perfect example — each is worth exactly one dollar. \nConcert tickets, by contrast, are non-fungible. Even if every Radiohead ticket is the same price, they aren’t directly exchangeable. Each represents a specific seat and a specific date — no other ticket will have those exact characteristics.\nDigital-artwork NFTs are mostly sold on specialized marketplaces like Zora, Rarible, and Opensea. If you’re more interested in games and sports collectibles, developers like Dapper Labs have created experiences including NBA Top Shot (virtual trading cards) and Cryptokitties (a Pokemon-ish digital-cat collecting app that actually was the first NFT hit in late-2017). Online games including Gods Unchained are starting to use NFTs to sell in-game assets like weapons or cosmetic upgrades. Real estate in new virtual worlds is sold via markets including Decentraland and The Sandbox.\nYou can also buy or sell some NFTs directly via a compatible crypto wallet.\nIf you’re interested in DeFi, you might have heard of the ERC-20 standard, which allows anyone to create a token compatible with the Ethereum blockchain. Those are “fungible” tokens. Most non-fungible tokens are built using the ERC-721 and ERC-1155 standards, which allow creators to issue unique cryptoassets via smart contract. Because each NFT is stored on a blockchain, there is an immutable record starting with the token’s creation and including every sale. (Some NFT-focused developers have also built their own alternative blockchains, including Dapper Lab’s Flow.)\nGood question! Some people display their digital artworks on large monitors. Some buy virtual real estate (via NFT, of course) in which they’re able to build virtual galleries or museums. You can also roam virtual worlds like Decentraland and check out other people’s collections. For some fans, the appeal is in the buying and selling — much like any other asset class. (The collector who sold the $6.9 million Beeple paid less than $70,000 for it in October 2020). \nMore and more mainstream artists have also gotten involved in the space — especially from the world of music. In early March, Nashville band Kings of Leon announced their next album would arrive in the form of multiple NFTs. Depending on which a fan buys, various perks will be unlocked — like alternate cover art, limited-edition vinyl, and even a “golden ticket” to a VIP concert experience. \nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-smart-contract",
    "text": "Definition\nA smart contract, like any contract, establishes the terms of an agreement. But unlike a traditional contract, a smart contract’s terms are executed as code running on a blockchain like Ethereum. Smart contracts allow developers to build apps that take advantage of blockchain security, reliability, and accessibility while offering sophisticated peer-to-peer functionality — everything from loans and insurance to logistics and gaming.\nJust like any contract, smart contracts lay out the terms of an agreement or deal. What makes smart contracts “smart,” however, is that the terms are established and executed as code running on a blockchain, rather than on paper sitting on a lawyer’s desk. Smart contracts expand on the basic idea behind Bitcoin — sending and receiving money without a “trusted intermediary” like a bank in the middle —  to make it possible to securely automate and decentralize virtually any kind of deal or transaction, no matter how complex. And because they run on a blockchain like Ethereum, they offer security, reliability, and borderless accessibility.\nSmart contracts allow developers to build a wide variety of decentralized apps and tokens. They’re used in everything from new financial tools to logistics and game experiences, and they’re stored on a blockchain like any other crypto transaction. Once a smart-contract app has been added to the blockchain, it generally can’t be reversed or changed (although there are some exceptions).\nSmart-contract-powered apps are often referred to as “decentralized applications” or “dapps” – and they include decentralized finance (or DeFi) tech that aims to transform the banking industry. DeFi apps allow cryptocurrency holders to engage in complex financial transactions — saving, loans, insurance — without a bank or other financial institution taking a cut and from anywhere in the world. Some of the more popular current smart-contract powered applications include:\nUniswap: A decentralized exchange that allows users, via smart contract, to trade certain kinds of crypto without any central authority setting the exchange rates.\nCompound: A platform that uses smart contracts to let investors earn interest and borrowers to instantly get a loan without the need for a bank in the middle. \nUSDC: A cryptocurrency that is pegged via smart contract to the US dollar, making one USDC worth one U.S. dollar. UDDC is part of a newer category of digital money known as stablecoins.\nSo how would you use these smart contract-powered tools? Imagine you’re holding some Ethereum that you’d like to trade for USDC. You could put some Ethereum into Uniswap, which, via smart contract, can automatically find you the best exchange rate, make the trade, and send you your USDC. You could then put some of your USDC into Compound to lend to others and receive an algorithmically determined rate of interest — all without using a bank or other financial institution. \nIn traditional finance, swapping currencies is expensive and time consuming. And it isn't easy or secure for individuals to loan out their liquid assets to strangers on the other side of the world. But smart contracts make both of those scenarios, and a vast variety of others, possible.\nSmart contracts were first proposed in the 1990s by a computer scientist and lawyer named Nick Szabo. Szabo famously compared a smart contract to a vending machine. Imagine a machine that sells cans of soda for a quarter. If you put a dollar into the machine and select a soda, the machine is hardwired to either produce your drink and 75 cents in change, or (if your choice is sold out) to prompt you to make another selection or get your dollar back. This is an example of a simple smart contract. Just like a soda machine can automate a sale without a human intermediary, smart contracts can automate virtually any kind of exchange.\nCurrently, Ethereum is the most popular smart contract platform, but many other cryptocurrency blockchains (including EOS, Neo, Tezos, Tron, Polkadot, and Algorand) can run them. A smart contract can be created and deployed to a blockchain by anyone. Their code is transparent and publicly verifiable, which means that any interested party can see exactly what logic a smart contract follows when it receives digital assets.\nSmart contracts are written in a variety of programming languages (including Solidity, Web Assembly, and Michelson). On the Ethereum network,  each smart contract’s code is stored on the blockchain, allowing any interested party to inspect the contract’s code and current state to verify its functionality. \nEach computer on the network (or “node”) stores a copy of all existing smart contracts and their current state alongside the blockchain and transaction data. \nWhen a smart contract receives funds from a user, its code is executed by all nodes in the network in order to reach a consensus about the outcome and resulting flow of value. This is what allows smart contracts to securely run without any central authority, even when users are making complex financial transactions with unknown entities.\nTo execute a smart contract on the Ethereum network, you will generally have to pay a fee called “gas” (so named because these fees keep the blockchain running).\nOnce deployed onto a blockchain, smart contracts generally can’t be altered, even by their creator. (There are exceptions to this rule.) This helps ensure that they can’t be censored or shut down. \nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-gamefi",
    "text": "GameFi, or game finance, is a fusion of online gaming and decentralized finance, creating an in-game economy.\nIt introduces the concept of play-to-earn (P2E), where in-game activity may provide the player with digital assets, rare items, and more.\nBlockchain technology and non-fungible tokens (NFTs) aim to give players sole ownership in GameFi, and players may receive digital tokens while playing.\nGameFi, short for gaming finance, is a relatively new concept that combines elements of gaming and decentralized finance. It represents a new category of decentralized applications (dApps) that strives to merge the gaming and blockchain worlds. By creating a gaming ecosystem that utilizes blockchain technology, digital assets, and decentralized finance, GameFi aims to improve player experience and provide opportunities for compensation.\nThe core idea behind GameFi is to provide players with ways to receive token rewards and assets for gaming achievements and skills. GameFi has been the catalyst behind a new subset of gaming experiences commonly referred to as play-to-earn games. These games provide various forms of rewards, including digital tokens and in-game assets such as virtual land, avatars, weapons, and costumes. Each project operates with a unique model and economy. Most commonly, the in-game assets are non-fungible tokens (NFTs) that run on the blockchain and can be traded on NFT marketplaces.\nBlockchain technology plays a crucial role in GameFi. It powers the games and the in-game tokens. Smart contracts also play a role, helping to decentralize much of the online gaming experience. Decentralized finance, non-fungible tokens, and play-to-earn mechanisms contribute to the functionality of GameFi. Blockchain games aim to provide open in-game economies with sovereign ownership over digital items and currencies.\nThere are advantages and disadvantages to GameFi’s emergence. On the positive side, P2E is an alternative to the traditional pay-to-play models of earlier video games. It gives way to more earning opportunities by simply engaging in blockchain games. It could potentially encourage more industry involvement, potentially leading to increased adoption. NFTs are a way to promote virtual asset ownership without control by centralized entities. On the other hand, there are challenges such as the need for a balanced economy and the risk of market volatility.\nGiven the current size of the industry, market forecasts suggest potential growth in the coming years. There is a possibility that the industry could reach over $100B, potentially contributing to the growth of DeFi, NFTs, the metaverse, and more. As the supply and demand for the gaming token scale, the platform may experience network effects. This initiates a self-reinforcing cycle and could be identified as a functional GameFi ecosystem.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-bitcoin-halving",
    "text": "TL;DR\nThe next Bitcoin halving is projected to occur on April 16, 2024 and will lower the mining reward to 3.125 bitcoins per block.\nBitcoin halving occurs approximately every four years and reduces the rate at which new bitcoins are created by 50%.\nThe halving reduces supply of new bitcoins entering the market, which could potentially lead to price appreciation if demand remains constant or increases.\nEven though Bitcoin is digital money, it can't be created endlessly, and verifiable scarcity is core to its value proposition.\nFoundational to the Bitcoin protocol are two concepts relating to scarcity:\nFirst, there is Bitcoin's limited supply. The protocol dictates that the total number of bitcoins that can ever exist is capped at 21 million, and it's impossible for more bitcoins to ever exist. This is contrary to fiat currencies, where more money can be printed at the discretion of the government or central bank, potentially leading to inflation.\nThe second concept is referred to as the halving. Approximately every four years, the Bitcoin mining reward, also known as the \"block reward,\" is halved. This means that the reward given to the contributors securing the network is reduced by 50%, directly impacting the rate at which new Bitcoins are introduced into circulation.\nIn May 2020, the amount of new Bitcoins added to the network (every 10 minutes) via virtual \"mining\" was halved from 12.5 to 6.25. In April 2024, it will drop again to around 3.125 — and the process will continue until all 21 million coins have been mined (which estimates say should happen around the year 2140).\nAt this point, miners will rely solely on transaction fees to validate blocks.\nBy issuing fewer bitcoins over time, the halving makes it more likely that Bitcoin's value will rise (assuming consistent levels of demand), which is in sharp contrast to fiat currencies, which typically decline in value over time via inflation (this is, for example, why you could get a Coke for a dime in the 1960s).\nIn short, the halving is one of the ways Bitcoin's protocol maintains scarcity, and scarcity is one of the reasons why Bitcoin is sought after by millions of people.\nBut scarcity is not the only reason why Bitcoin halving is important, and there are other elements that make the halving an event closely followed.\nFor example, Bitcoin halving usually attracts more press coverage of cryptocurrencies and Bitcoin. As the event garners headlines, it naturally piques the interest of potential new investors who might not have previously considered investing in Bitcoin or engaging with cryptocurrencies. This surge in attention can lead to an increase in demand for Bitcoin as new and existing investors aim to capitalize on the potential price movements caused by the halving.\nTo better understand how halving works, we first need to understand exactly what Bitcoin mining is.\nBitcoin uses a proof-of-work (PoW) system to validate transaction information, called this way because solving the encrypted hash takes time and energy, which acts as proof that work was done. In this system, individuals use computers or specialized mining rigs to join the Bitcoin network, acting as both transaction processors and validators.\nOnce a block is filled with transactions, it is closed and sent to a mining queue, where miners race to be the first to solve the block's cryptographic puzzle. When the miners confirm the legitimacy of the transactions in a block, they open a new one and receive a reward for their work.\nThis process creates a chain of blocks containing information, creating what we know as the blockchain.\nWith each halving event, the reward for these network contributors is slashed by half, slowing down the pace at which new bitcoins are introduced into circulation. For context, as of March 2024, more than 19 million bitcoins have been mined, meaning there are approximately 2 million bitcoins left to be virtually \"mined.\"\nAs of March 2024, Bitcoin has already gone through three halvings:\nOn November 28, 2012, the reward dropped from 50 to 25 bitcoins per block.\nThen on July 9, 2016, it went down again from 25 to 12.5 bitcoins per block.\nAnd most recently, on May 11, 2020, it halved from 12.5 to 6.25 bitcoins per block.\nSince Bitcoin blocks are mined about every 10 minutes, the next halving is projected to occur around the third week of April 2024, lowering the mining reward to 3.125 bitcoins per block.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-dex",
    "text": "The peer-to-peer lending, speedy transactions, and anonymity made possible by DEXs have made them increasingly popular in developing economies — where solid banking infrastructure might not be available. Anyone with a smartphone and an internet connection can trade via a DEX. \nTrickier user interfaces Navigating decentralized exchanges requires some specialized knowledge and the interfaces aren’t always easy — be prepared to do a lot of research and don’t expect the DEX itself to offer much handholding. You’ll generally have to look offsite for a walk-through or explainer. Caution is required because it’s possible to make an unfixable error, like sending coins to the wrong wallet. Another common issue is known as “impermanent loss,” which can result from pairing a more volatile cryptocurrency with a less volatile one in a liquidity pool. (The main takeaway here? Do your own research.)\nSmart contract vulnerability Any DeFi protocol is only as secure as the smart contracts that power it — and code can have exploitable bugs (despite lengthy testing) that can result in the loss of your tokens. And while a smart contract might work as intended under normal circumstances, not all rare events, human factors, and hacks can be anticipated by developers. \nRiskier coins With the unvetted, vast array of tokens available on most DEXs, there are also a greater number of scams and schemes to be wary of. A token that’s on a hot streak could suddenly be “rug pulled,” when its creator mints a bunch of new tokens, overwhelming the liquidity pool and tanking the value of the coin. Before you buy a new-to-you cryptocurrency or experiment with a new it’s important to learn as much as you can — read white papers, visit developer Twitter feeds or Discord channels,  and look for audits of any particular project you’re interested in (some bigger auditors include Certik, Consensys, Chain Security, and Trail of Bits).\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-internet-computer",
    "text": "The Internet Computer is creating a decentralized internet — with independent data centers providing alternative to corporate cloud services\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-proof-of-work-or-proof-of-stake",
    "text": "“Proof of work” and “proof of stake” are the two major consensus mechanisms cryptocurrencies use to verify new transactions, add them to the blockchain, and create new tokens.\nDefinition\n“Proof of work” and “proof of stake” are the two major consensus mechanisms cryptocurrencies use to verify new transactions, add them to the blockchain, and create new tokens.  Proof of work, first pioneered by Bitcoin, uses mining to achieve those goals. Proof of stake — which is employed by Cardano, the ETH2 blockchain, and others — uses staking to achieve the same things.   \nDecentralized cryptocurrency networks need to make sure that nobody spends the same money twice without a central authority like Visa or PayPal in the middle. To accomplish this, networks use something called a “consensus mechanism,” which is a system that allows all the computers in a crypto network to agree about which transactions are legitimate. \nThere are two major consensus mechanisms used by most cryptocurrencies today. Proof of work is the older of the two, used by Bitcoin, Ethereum 1.0, and many others. The newer consensus mechanism is called proof of stake, and it powers Ethereum 2.0, Cardano, Tezos and other (generally newer) cryptocurrencies.  To understand proof of stake, it’s helpful to first understand proof of work, so we’ve paired them in this explainer.\nProof of work is the original crypto consensus mechanism, first used by Bitcoin. Proof of work and mining are closely related ideas. The reason it’s called “proof of work” is because the network requires a huge amount of processing power. Proof-of-work blockchains are secured and verified by virtual miners around the world racing to be the first to solve a math puzzle. The winner gets to update the blockchain with the latest verified transactions and is rewarded  by the network with a predetermined amount of crypto. \nProof of work has some powerful advantages, especially for a relatively simple but hugely valuable cryptocurrency like Bitcoin (learn more about how Bitcoin works). It’s a proven, robust way of maintaining a secure decentralized blockchain. As the value of a cryptocurrency grows, more miners are incentivized to join the network, increasing its power and security.  Because of the amount of processing power involved, it becomes impractical for any individual or group to meddle with a valuable cryptocurrency’s blockchain. \nOn the flip side, it’s an energy-intensive process that can have trouble scaling to accommodate the vast number of transactions smart-contract compatible blockchains like Ethereum can generate. And so alternatives have been developed, the most popular of which is called proof of stake.\nEthereum’s developers understood from the beginning that proof of work would present limitations in scalability that would eventually need to be overcome — and, indeed, as Ethereum-powered decentralized finance (or DeFi) protocols have surged in popularity, the blockchain has struggled to keep up, causing fees to spike. \nWhile the Bitcoin blockchain mostly just has to process incoming and outgoing bitcoin transactions, much like a vast checkbook, Ethereum’s blockchain also has to process a vast array of DeFi transactions, stablecoin smart contracts, NFT minting and sales, and whatever innovations developers come up with in the future. \nTheir solution has been to build an entirely new ETH2 blockchain — which began rolling out in December 2020 and should be finished in 2022. The upgraded version of Ethereum will employ a faster and less resource intensive consensus mechanism called proof of stake. Cryptocurrencies including Cardano, Tezos, and Atmos all use proof-of-stake consensus mechanisms — with the goal being to maximize speed and efficiency while lowering fees. \nIn a proof of stake system, staking serves a similar function to proof of work’s mining, in that it’s the process by which a network participant gets selected to add the latest batch of transactions to the blockchain and earn some crypto in exchange. \nThe exact details vary by project, but in general proof of stake blockchains employ a network of “validators” who contribute — or “stake” — their  own crypto in exchange for a chance of getting to validate new transaction, update the blockchain, and earn a reward. \nThe network selects a winner based on the amount of crypto each validator has in the pool and the length of time they’ve had it there — literally rewarding the most invested participants. \nOnce the winner has validated the latest block of transactions, other validators can attest that the block is accurate. When a threshold number of attestations have been made, the network updates the blockchain. \nAll participating validators receive a reward in the native cryptocurrency, which is generally distributed by the network in proportion to each validator’s stake. \nBecoming a validator is a major responsibility and requires a fairly high level of technical knowledge. The minimum amount of crypto that validators are required to stake is often relatively high (for ETH2, for example, it’s 32 ETH) and validators can lose some of their stake via a process called slashing if their node goes offline or if they validate a “bad” block of transactions.  \n But even if that sounds like too much responsibility, you can still participate in staking by joining a staking pool run by someone else — and earn rewards for crypto that would otherwise be sitting around. This process is often referred to as delegating, and tools offered by exchanges by Coinbase can make it simple and seamless.\nEnergy consumption is one major difference between the two consensus mechanisms. Because proof-of-stake blockchains don’t require miners to spend electricity on duplicative processes (competing to solve the same puzzle), proof of stake allows networks to operate with substantially lower resource consumption.\nBoth consensus mechanisms have economic consequences that penalize network disruptions and thwart malicious actors. In proof of work, the penalty for miners submitting invalid information, or blocks, is the sunk cost of computing power, energy, and time. In proof of stake, the validators’ staked crypto funds serve as an economic incentive to act in the network’s best interests. In the case that a validator accepts a bad block, a portion of their staked funds will be “slashed” as a penalty. The amount that a validator can be slashed depends on the network.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender\nAvalanche\nInternet Computer\nPolygon Ecosystem Token\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-protocol",
    "text": "Definition\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-private-key",
    "text": "Private key\nA private key is like a password — a string of letters and numbers — that allows you to access and manage your crypto funds.\nWhen you first buy cryptocurrency, you are issued two keys: a public key, which works like an email address (meaning you can safely share it with others, allowing you to send or receive funds), and a private key, which is typically a string of letters and numbers (and which is not to be shared with anyone). You can think of the private key as a password that unlocks the virtual vault that holds your money. As long as you — and only you — have access to your private key, your funds are safe and can be managed anywhere in the world with an internet connection.\nThe system of public and private keys are one of the cryptographic innovations that make digital money possible and secure. Here is how they work.\nCryptocurrencies like Bitcoin and Ethereum are decentralized — meaning there is no bank or any other institution in the middle holding your digital money. Instead, your crypto is distributed across a network of computers via a technology called a blockchain. One feature of crypto blockchains is that they are open: all public key and transaction information is available for anyone to see.\nVia some complicated math, your public key is actually generated by your private key, which makes them a matched pair. When you make a transaction using your public key, you verify that it’s really you by using your private key.  \nEven though everything is out in the open, it’s also anonymous — you don’t need to provide a name or address or any other information to use cryptocurrency. \nTake Bitcoin, for example. Even though any curious observer can see when Bitcoin is bought or sold or used, only the holder of a private key can make those transactions.\nLike any password, it’s crucial to keep your private keys safe. The two major ways to keep track of them are: \nStore them online in a crypto wallet: The best and simplest option for most people is to use a virtual wallet, like the one offered by Coinbase, to manage your private keys. These are known as “hot” wallets, because your private keys are stored on the internet. This makes buying, selling, or using your digital money as convenient and accessible as using a credit card online. Choose a wallet provided by a company with a long track record for security and features like two-factor authentication.\nStore them offline somewhere safe: Some investors choose to keep their private keys on a computer that isn’t connected to the internet, written on pieces of paper, or even just memorized. This is referred to as “cold storage,” and while it does protect your private key against digital theft, it makes using your cryptocurrency much less convenient while creating other risks. \nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-are-technical-analysis-and-fundamental-analysis",
    "text": "Definitions\nTechnical analysis looks at patterns in market data to identify trends and predict how markets might move in the future. Fundamental analysis is a “big picture” approach that examines financials, user community, and future real-world utility. \nThere are a lot of methods you can use to research an asset you’re interested in trading. But two of the major strategies investors use are called technical analysis and fundamental analysis. \nTechnical analysis focuses on an asset’s historical market performance: by examining price over time and trading volume over time, you can get a sense of how the market sees the asset. Is it rising or falling? Are people putting money in or taking it out? Is it traded widely and in large quantities? Those are the kinds of questions that technical analysis asks.  \nFundamental analysis, on the other hand, involves looking at an asset’s “fundamentals” — it’s more of a big-picture approach. It incorporates information like a cryptocurrency’s financials, user community, and potential real-world applications. \nBoth are valuable ways of understanding an investment, and can be applied to everything from stocks and bonds to, of course, cryptocurrency. And they can both help you build a trading strategy and identify when you want to buy or sell a particular asset.\nWith fundamental analysis you can decide if an asset is overpriced or underpriced based on how you see its intrinsic value — as in, will it be more useful in the future? Take, for instance, Ethereum. Most decentralized-finance (or DeFi) applications run on its blockchain. If you assume DeFi will grow, you might guess that Ethereum’s value will increase in the future.\nTechnical analysis is more of a numbers-driven approach to decision-making. It assumes that the market has already done the work of incorporating all the known information via the current price (which you can find in the Coinbase app or many other places online) and amount of trading activity (look to crypto-data sites like Nomics and CoinGecko).\nBecause current prices reflect market forces like supply and demand, practitioners of technical analysis believe that the price of an asset should give you a snapshot of how the public feels about it right now. This is known as market sentiment, and it’s an indicator traders use to predict trends and make investment decisions.\nUnless you have access to high-level models and tools that pro traders use, using both strategies together can provide a fuller view of your trades. While fundamental analysis looks at the more objective indicators for an asset's potential long-term value – things like network activity, use case, business model, and roadmap — technical analysis focuses specifically on an asset’s market performance. \nProfessional traders, on the other hand, might rely much more on one or other. (Large, mature markets tend to have lots of traders of both types.) A trader might, for instance, perform technical analysis using computer models that deeply examine changes in price and volume – including regressions, the relative strength index, and stock-market data. If a given asset tends to go through fairly regular boom-and-bust cycles, technical analysis can give investors insight into the rhythm of these cycles, helping them see opportunities to capitalize on these short-term cycles. \nExecuting successful short-term investment strategies is notoriously difficult. History doesn’t repeat itself, so studying price patterns won’t necessarily help you make strong predictions, especially in volatile markets. \nYou should invest only what you can afford. A financial advisor can help you develop a strategy and understand the risks associated with investing in cryptocurrencies.\nCoinbase offers simple and advanced trading. Advanced trading is for experienced traders and is subject to the Trading Rules. Fees on the two platforms vary. Content is for informational purposes and is not investment advice. Investing in crypto comes with risk.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-volatility",
    "text": "Definition\nVolatility is a measure of how much the price of an asset has moved up or down over time. Generally, the more volatile an asset is, the riskier it’s considered to be as an investment — and the more potential it has to offer either higher returns or higher losses over shorter periods of time than comparatively less volatile assets.\nVolatility is a measure of how much the price of any particular asset has moved up or down over time. Generally, the more volatile an asset is, the riskier it’s considered to be as an investment — and the more potential it has to offer either higher returns or higher losses over shorter periods of time than comparatively less volatile assets. \n As a newer asset class, crypto is widely considered to be volatile — with the potential for significant upward and downward movements over shorter time periods. Stocks are considered to have a wide range of volatility, from the relative stability of large-cap stocks (like Apple or Berkshire Hathaway) to often erratic “penny stocks.” Bonds, by contrast, are considered to be a lower-volatility asset — and typically see less dramatic upward and downward swings that take place over longer time frames.\nWhen people talk about measuring volatility, they’re usually referring to “historical volatility,” a number derived from a study of prices over a specific time period (often 30 days or a year). The prediction of future movements is called “implied volatility” — and because nobody can actually predict the future it’s a less exact science (although it’s the basis for widely used financial tools like the Cboe Volatility Index, nicknamed the “fear index,” which predicts the next 30 days’ stock market volatility).   Quantifying volatility can be done a couple of ways: \nYou can use a method called beta, which measures how volatile one stock is relative to the broader market (the typical benchmark is the S&P 500). \n You can compute an asset’s standard deviation, which is a measure of how widely its price has diverged from its historical average.\nVolatility is one of the primary factors that goes into assessing investment risk. Traditionally, investors will take on a high level of risk if they believe the potential reward is worth the possibility of losing some of their investment. (Or all of their investment, as in the recent case of high-risk hedge-fund manager Bill Hwang, whose entire $20 billion dollar fund disappeared in two days.) \nTraditionally, retail investors are advised to diversify their investments within an asset class as a way of reducing risk. One popular strategy is to invest in a basket of stocks (or an index fund), rather than just a few. To further reduce the potential for downside, they may also pair investments in more volatile asset classes like stocks with investments in less volatile classes like bonds. \nAs an asset class that’s only a little more than a decade old, crypto has seen a series of steep rises and subsequent falls — and is considered to be more volatile as a category than stocks. That said, higher trading volumes on Bitcoin (by far the biggest cryptocurrency by market cap) and increased institutional participation seem to be reducing its volatility over time. Cryptocurrencies with lower trading volumes or emerging cryptoassets like DeFi tokens tend to have higher volatility — when experimenting with these assets as a beginner it’s best to risk amounts you can afford to lose. \nFactors that can increase volatility include positive or negative news coverage and earnings reports that are better or worse than expected. Unusually high spikes in volume of trading will usually correspond to volatility. Very low volume (as seen with so-called penny stocks that don’t trade on major markets or smaller cryptocurrencies) also usually corresponds with high volatility.\nFor some crypto investors, high volatility is part of the appeal — it creates the possibility for high returns. (And even as Bitcoin’s volatility seems to be declining, it often moves by double-digit percentages in a single week, allowing for strategies like “buying the dip.”) \nFor less risk-tolerant investors, there are strategies that can be used to limit the downside impact of volatility, like dollar-cost averaging. (Generally, investors with longer-term strategies who have good reason to believe that an investment will ultimately rise over time don’t need to think as much about short-term volatility.)  And there are now cryptocurrencies specifically designed to have low volatility called stablecoins (including USD Coin and Dai) — these have their price pegged to a reserve asset like the U.S. dollar.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-uniswap",
    "text": "A beginner's guide to the popular decentralized exchange (or DEX) on the Ethereum blockchain. It allows users anywhere in the world to trade crypto without an intermediary.\nDefinition\nUniswap is the largest decentralized exchange (or DEX) operating on the Ethereum blockchain. It allows users anywhere in the world to trade crypto without an intermediary. UNI, the governance token that allows users to vote on key protocol changes, is the fourth largest cryptocurrency by market cap on Coinbase as of April 2021 — with a total value of more than $18 billion.\nUniswap was one of the first decentralized finance (or DeFi) applications to gain significant traction on Ethereum — launching in November 2018. Since then, numerous other decentralized exchanges have launched (including Curve, SushiSwap, and Balancer), but Uniswap is currently the most popular by a significant margin. As of April 2021, Uniswap had processed over $10 billion in weekly trading volume.\nUniswap pioneered the Automated Market Maker model, in which users supply Ethereum tokens to Uniswap “liquidity pools” and algorithms set market prices (as opposed to order books, which match bids and asks on a centralized exchange like Coinbase) based on supply and demand.\nBy supplying tokens to Uniswap liquidity pools, users can earn rewards while enabling peer-to-peer trading. Anyone, anywhere, can supply tokens to liquidity pools, trade tokens, or even create and list their own tokens (using Ethereum’s ERC-20 protocol). There are currently hundreds of tokens available on Uniswap, and some of the most popular trading pairs are stablecoins like USDC and Wrapped Bitcoin (WBTC).\nSome of the potential advantages of decentralized exchanges like Uniswap include:\nSafe: Funds are never transferred to any third party or generally subject to counterparty risk (i.e. trusting your assets with a custodian) because both parties are trading directly from their own wallets.\nGlobal and permissionless: There is no concept of borders, or restrictions on who can trade. Anyone with a smartphone and an internet connection can participate.\nEase of use and pseudonymous: No account signup or personal details are required.\nIn order to use Uniswap, all you need is an Ethereum wallet, such as Coinbase Wallet, and a bit of ETH (which you’ll need to pay for gas fees). Using the app browser built into Coinbase Wallet's mobile application or its desktop browser extension, you can access app.uniswap.org to start swapping tokens or supplying liquidity. \nOne issue users of all Ethereum-based apps including Uniswap face are transaction fees (also called gas) that can vary widely in price and can make it expensive to use the network. Multiple solutions to this issue are in the works, from the long-planned transition to the ETH2 blockchain (scheduled for sometime in 2022) to the nearer-term rollout of a “Layer 2” scaling solution called Optimism later this year. Uniswap developers are confident that Optimism will allow for significantly cheaper Uniswap transactions.\nIn early May 2021, Uniswap v3 launched with the goal of making transactions faster and cheaper.\nAfter years of successful operation and on its path to complete decentralization, Uniswap introduced the UNI token to enable community ownership over the protocol, allowing stakeholders to vote on key protocol changes and development initiatives. When Uniswap released the token in September 2020, it used a unique form of distribution in which it “airdropped” 400 UNI tokens to each Ethereum address that had ever used the protocol. Over 250,000 Ethereum addresses received the airdrop, which was worth nearly $1,400 at the time. Airdrops have since become a popular way for DeFi apps to reward longtime users – Uniswap has said it plans to distribute a total of 1 billion UNI over four years. \nIt’s because Uniswap, like most crypto protocols, is open source, meaning anyone can both see exactly how it works and adapt the code to create a competitor. \nIn recent years, a large number of DEXs adapted from Uniswap’s code have launched, including food-named competitors like SushiSwap and PancakeSwap. (If you want to read more, check out this issue of Coinbase’s Around the Block newsletter.) \nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-hash-rate",
    "text": "Hash rate is a measure of the computational power of a blockchain network, group, or individual.\nIt is used to determine the mining difficulty of a blockchain network and can be used as a gauge of security.\nHash rate is measured by the number of guesses each mining computer makes per second to solve for the hash on a blockchain network.\nHash rate is a critical metric in the world of digital assets, representing the speed at which a computer can perform hashing computations. These computations are part of the process of validating transactions, referred to as digital asset mining. The hash rate serves as a performance indicator for specialized mining machines, showing the rate at which a mining hardware processes data in its quest to compute a valid block hash.\nIn the context of Bitcoin and other digital assets, the hash rate is associated with the potential compensation of a miner or mining pool. A higher hash rate corresponds to a greater likelihood of successfully mining a block, thereby increasing the miner's chances of being compensated for processing transactions.\nA blockchain network typically uses a special mathematical function known as the hash algorithm to randomly produce a hash value. Miners on the network compete to generate the correct hash. The winning miner is then allowed to validate transactions and is compensated for solving the mathematical puzzle.\nHowever, generating a valid hash can take millions of guesses. The number of guesses made per second is computed as the hash rate. High hash rates mean that the network has many competing miners, which generally indicates that a network is secure and efficient.\nHash rates measure the number of computations a network can perform per second. A blockchain network’s combined hash rate is estimated as the sum of the total hash rates of all the mining hardware in the network.\nHash rates are calculated in terms of hashes (guesses) per second (h/s). They can be represented in notations such as kilo (KH/s), mega (MH/s), giga (GH/s), tera (TH/s), peta (PH/s), and exa (EH/s).\nThe hash rate is an important metric for assessing the strength of a blockchain network – more specifically, its security. The more machines dedicated by honest miners to discovering the next block, the higher the hash rate rises and the harder it becomes for malicious agents to disrupt the network.\nA high hash rate is associated with the robustness of a Proof of Work (PoW) blockchain network, as there is less of a chance of an attack on the network. The more miners who are part of a blockchain network competing to mine blocks, the less likely it is for a malicious attack on the network to occur.\nThe history of Bitcoin's hash rate growth is a testament to the evolution of mining technology. Since its early days, the hash rate of the Bitcoin network has experienced a surge, catalyzed by the development of specialized mining hardware known as ASIC miners. As of the last available data in October 2021, the Bitcoin network operates at a hash rate of roughly 150,000,000 TH/s, indicating the scale of the network's computational power.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-erc-721",
    "text": "ERC-721 is a non-fungible token standard on the Ethereum blockchain.\nIt provides a set of guidelines for creating unique tokens that represent digital assets.\nERC-721 has a wide range of applications in gaming, art, collectibles, and more.\nERC-721 is a non-fungible token standard on the Ethereum blockchain. It provides a set of guidelines for creating unique tokens that represent digital assets. These tokens are non-fungible, meaning that they cannot be exchanged on a one-to-one basis due to their unique properties. The significance of ERC-721 lies in its potential to facilitate the creation of NFTs, which have a wide range of applications in gaming, art, collectibles, and more.\nThe ERC-721 standard consists of a set of functions that developers can implement in their smart contracts to create, transfer, and manage NFTs. These functions allow for the creation of unique tokens with their own metadata, making them distinguishable from one another. Under the hood, ERC-721 smart contracts maintain a record of token ownership, allowing for the transfer of tokens between users. The contract also keeps track of the total supply of tokens and the balance of tokens owned by individual addresses.\nThe ERC-721 token standard has several features for unique digital assets in the form of NFTs. It allows users to have, transfer, and manage unique digital assets. The ERC-721 token standard has been used in the context of digital art, where artists can create unique pieces of art as NFTs, providing them with a new avenue for their work. The ERC-721 token standard is used in the gaming industry, where game developers can create unique in-game items as NFTs.\nThe initial ERC-721 specification was proposed by Dieter Shirley as an Ethereum Improvement Proposal (EIP), which is a process for introducing new standards to Ethereum. The official authors of the ERC-721 standard are William Entriken, Dieter Shirley, Jacob Evans, and Nastassia Sachs. It's important to note that anyone can submit an EIP, but it goes through a process of review and revision before it is accepted by the community.\nOne of the most widespread uses of the ERC-721 token standard is for digital art. Publishing art, or any type of media, on the blockchain means that it can be exchanged and transferred via the underlying blockchain network. NFTs are transforming a number of other industries, by allowing individuals to have a stake in their digital landscape. This can be seen in non-fungible gaming assets, metaverse land and asset, Web3 community memberships, and more.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-the-ethereum-virtual-machine",
    "text": "The Ethereum Virtual Machine (EVM) is a decentralized computation engine that executes smart contracts on the Ethereum network.\nEVM is not exclusive to Ethereum; it is also used by other blockchains like Polygon, Arbitrum, and Avalanche.\nEVM plays a crucial role in maintaining consensus across the Ethereum blockchain and facilitating the execution of decentralized applications (dApps).\nThe Ethereum Virtual Machine (EVM) is a decentralized computation engine that executes smart contracts on the Ethereum network. It is a crucial component of Ethereum's infrastructure, enabling the execution of code exactly as intended. EVM is not a physical machine but a virtual one, operating across thousands of computers, or nodes, participating in the Ethereum network. This distributed nature of EVM ensures the security and reliability of the Ethereum network.\nThe EVM operates as a state machine, meaning it computes a new valid state from block to block based on a set of predefined rules. These rules govern the execution of smart contracts and the updating of the Ethereum blockchain's state. When a smart contract is executed, the EVM interprets the contract's code, which is written in a language called Solidity and then converted into bytecode. The EVM uses this bytecode to perform specific tasks, ensuring that the contract's code is executed exactly as written.\nThe EVM is instrumental in maintaining consensus across the Ethereum blockchain. Every node in the Ethereum network runs the EVM, ensuring that all nodes agree on the state of the blockchain. This consensus is vital for the security and integrity of the Ethereum network. The EVM's ability to execute smart contracts enables the creation of decentralized applications (dApps), which are applications that run on the blockchain rather than on a centralized server. This opens up a wide range of possibilities for developers and users alike, from decentralized finance (DeFi) applications to non-fungible tokens (NFTs).\nWhile the EVM is a core component of the Ethereum network, it is not exclusive to Ethereum. Many other blockchains, including Polygon, Arbitrum, and Avalanche, also use the EVM. This is because the EVM provides an environment for executing smart contracts, making it easier for developers to build applications that can run on multiple blockchains. This interoperability is a key advantage of the EVM and contributes to its widespread adoption.\nAs the blockchain space continues to evolve, the EVM is likely to play a role. Its ability to execute smart contracts and maintain consensus across the blockchain makes it a vital component of any blockchain that supports dApps. As more blockchains adopt the EVM, we can expect to see increased interoperability between different blockchains, opening up new possibilities for cross-chain applications and services.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-a-node-in-cryptocurrency",
    "text": "Nodes are components of a blockchain network, maintaining the latest record of transactions and ensuring network rules are adhered to.\nNodes can be of different types, each with specific roles, such as validating transactions or creating new blocks.\nAnyone may set up a node, potentially contributing to the decentralization and security of the blockchain network.\nA crypto node is a computer that is part of a blockchain network. It maintains the latest record of transactions and ensures that all participants adhere to the network's rules. Nodes are components of a blockchain network, facilitating decentralized transactions. They aim to validate and process transactions without the need for a centralized entity, striving to ensure the integrity and security of the network.\nNodes work by maintaining a distributed ledger, known as a blockchain, that stores the complete history of transactions on a network. When a new group of transactions, or a block, is added to the blockchain, it is broadcast from node to node. This allows each node to update its own database in the same way, striving to ensure consistency across the network. Nodes aim to validate each other's transactions, striving to maintain a database of past transactions in a distributed manner.\nThere are various types of nodes, each with different roles within the blockchain network. For instance, miner nodes create and propose new blocks, while validator nodes aim to verify and approve new transactions. Some nodes, known as full nodes, store the entire history of a blockchain network, contributing to the network's security. The variety of node types is a characteristic of the blockchain network.\nSetting up a node involves downloading the blockchain's software onto a personal computer. This allows the computer to interact with the blockchain network, validating and broadcasting transactions. By setting up a node, individuals may participate in the network and its decentralization. This openness to participation is a feature of blockchain networks, reflecting their democratic and transparent nature.\nNodes are important to the functioning of a blockchain network. They aim to ensure that transactions are processed correctly and efficiently, contributing to the network's security and reliability. Nodes facilitate the peer-to-peer transfer of digital assets and other applications of blockchain technology. Therefore, understanding nodes may help in understanding how cryptocurrency and blockchain technology work.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-sidechains",
    "text": "Sidechains are separate blockchain networks that connect to a parent blockchain, aiming to enhance its scalability and interoperability.\nThey utilize a two-way peg mechanism to facilitate the transfer of digital assets between the parent blockchain and the sidechain.\nSidechains have their own consensus protocols, which may contribute to the privacy and security of the blockchain network.\nSidechains are independent blockchain networks that connect to a parent blockchain, often referred to as the mainnet. This connection is facilitated by a two-way peg, a mechanism that allows digital assets to be transferred between the parent blockchain and the sidechain.\nThe concept of sidechains was first introduced in an academic paper published in 2014 by a group of Bitcoin engineers. They proposed sidechains as a potential solution to some of the challenges faced by Bitcoin's infrastructure, such as scalability and decentralization trade-offs, and concerns about privacy and censorship.\nThe operation of sidechains involves several key components, including a two-way peg and smart contracts. The two-way peg is essential for facilitating the transfer of digital assets between blockchains. It allows digital assets to be locked on the mainnet and an equivalent amount to be unlocked on the sidechain, and vice versa.\nSmart contracts play a crucial role in validating and verifying the transfer of digital assets between the parent chain and the sidechain. They enforce honesty among the validators involved in the two-way pegged operation, minimizing the risk of fraudulent transfers or halted transactions.\nSidechains may contribute to improving the efficiency of the mainnet in several ways. They strive to tackle the issue of blockchain scalability by operating separately from the main blockchain, which may enhance the efficiency of the parent blockchain.\nSidechains may provide developers with different options than the main blockchain. They can experiment with different consensus protocols and blockchain features without affecting the operation of the mainnet.\nWhile sidechains may offer several benefits, they also come with potential drawbacks. One concern is the security of sidechains. Since they operate independently of the mainnet, they may not inherit the same level of security, making them potentially more vulnerable to attacks.\nAnother concern is the reliance on validators in the two-way pegged operation. If these validators do not act honestly, it could lead to fraudulent transfers or halted transactions.\nThere are several real-life examples of sidechains in use today. For instance, the Liquid Network and Rootstock are sidechains of Bitcoin, designed to enhance its scalability and functionality. Ethereum also has its own sidechains, such as Polygon, which seeks to enhance Ethereum's scalability and transaction speed.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-brc-20-tokens",
    "text": "BRC-20 tokens are a development in the cryptocurrency space.\nThey are a development in the cryptocurrency space.\nBRC-20 tokens are a development in the cryptocurrency space. They were created by a blockchain analyst. The BRC-20 token standard supports the creation and transfer of fungible tokens via a protocol. This protocol allows data to be inscribed onto individual fractions of a Bitcoin.\nUnlike other token standards, the BRC-20 standard operates differently. It uses inscriptions to program fractions of a Bitcoin, creating unique tokens. These tokens are nonfungible, meaning each one is unique and has distinct attributes.\nThe BRC-20 token standard has several features that have been noted by users. One of the main features is its compatibility with the Bitcoin network. This compatibility allows Bitcoin tokens and BRC-20 tokens to integrate with the Bitcoin blockchain, capitalizing on the network’s robustness and widespread acceptance.\nAnother feature of the BRC-20 standard is its simplicity. Unlike other token standards that rely on complex contracts, BRC-20 uses a simplified tokenization mechanism. This simplicity allows users to mint and transfer BRC-20 tokens without needing specialized technical expertise.\nFurthermore, the BRC-20 token standard aims to provide security. It leverages the inherent robustness of the Bitcoin blockchain, which is one of the many chains in the industry. By utilizing the Bitcoin blockchain, the BRC-20 standard can capitalize on these security mechanisms to maintain its functionality.\nWhile the BRC-20 token standard has many features, it's important to note that it is still experimental and users should exercise caution. The process of deploying, minting, and transferring BRC-20 tokens is not yet user-friendly, and there are limited tooling and supporting services available.\nAdditionally, while the BRC-20 standard allows for the creation of fungible tokens on the Bitcoin blockchain, it does not offer the same versatility as contracts. Tokens are limited to token minting and transfers, whereas contracts can be used for a wider range of applications.\nThe ongoing development of BRC-20 tokens is being explored, with more projects exploring the standard and new use cases likely to emerge. The vast and diverse user base of the Bitcoin network, coupled with the potential for innovation, suggests that BRC-20 tokens could play a role in the ongoing development of the cryptocurrency space. However, as with any experimental technology, it's important to approach with caution and stay updated on the project's progress.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-cloud-mining-in-crypto",
    "text": "Cloud mining is a method to mine cryptocurrencies by leasing equipment or renting computing power from data centers.\nIt offers a more accessible avenue to mining, eliminating hardware and operational challenges.\nHowever, cloud mining comes with its own set of risks, which can be mitigated with diligent research and decision-making.\nCloud mining is a process that allows individuals to participate in the mining of cryptocurrencies, such as Bitcoin, without needing to own or manage the mining hardware themselves. Instead, users provide compensation to rent mining capacities from a company that owns and manages the mining hardware and process. When the rented mining hardware mines a block, the rewards are shared among the users and the company. This method negates the process of individually setting up physical mining hardware, getting a high-speed internet connection, sourcing electricity, and maintaining the hardware.\nCloud mining works on the principle of pooled mining. Users acquire a certain amount of \"hash power\" from a mining farm, which is a remote server facility specialized in crypto mining. The provider gives them access to payouts in return that are based on the hashing power the miners have opted for. This enables individuals in remote regions with little to no physical infrastructure and limited technical skills to participate in the mining industry. The mining takes place \"in the cloud,\" rather than your personal computer.\nCloud mining relieves you of the financial burden of acquiring expensive equipment and maintaining it. You get to pass those costs on to the owner. By renting hash power from a mining farm, you receive a portion of the farm's overall returns without the costs. This makes mining accessible to a broader base of people because it reduces the need to acquire and maintain equipment or pay direct energy costs.\nOne of the downfalls of cryptocurrency is that because some command such a high price, scams have been reported. There is the prospect of diminishing returns because of increasing mining difficulty and more miners entering the networks to compete for earnings. This dominance promotes the centralization of cryptocurrencies, which were intended to be decentralized financial systems.\nThe cloud mining space has been rife with scams and fraudulent operations. It's crucial to thoroughly research and verify the legitimacy of a cloud mining company before participating. Always ensure that the company has a transparent mining process and offers a fair pricing structure. Be wary of companies that guarantee returns or use assertive marketing approaches.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-zero-knowledge-proofs",
    "text": "Zero-knowledge proofs (ZKPs) are a cryptographic method that allows one party to prove the validity of a statement without revealing any information about the statement itself.\nZKPs represent a development in cryptography, aiming to enhance privacy and security in various applications, including blockchain technology.\nZKPs have certain drawbacks, such as hardware costs and proof verification costs.\nZero-knowledge proofs (ZKPs) are a cryptographic protocol that enables one party, known as the prover, to convince another party, the verifier, that a particular claim is true without disclosing any details about the claim itself. This concept was first introduced in a 1985 paper titled \"The knowledge complexity of interactive proof systems\" and has since been developed and improved for use in various applications.\nIn a ZKP, the prover strives to establish a claim, and the verifier is responsible for verifying the claim. The prover can demonstrate to the verifier that a statement is accurate without revealing any additional information regarding the statement. This is achieved by providing proof, or a small amount of information, that can be verified by the verifier to ensure that the statement is true.\nZero-knowledge proofs are a development in applied cryptography as they strive to enhance the security of information for individuals. For instance, consider how you might prove a claim (e.g., \"I am a citizen of X country\") to another party (e.g., a service provider). You'd typically need to provide \"evidence\" to back up your claim, such as a national passport or driver’s license.\nHowever, this approach has its drawbacks, primarily the lack of privacy. Personally Identifiable Information (PII) shared with third-party services is stored in central databases, which are vulnerable to hacks. With identity theft becoming a critical issue, there are calls for more privacy-protecting means of sharing information, and this is where ZKPs could be utilized.\nAt a high level, a zero-knowledge proof works by having the verifier ask the prover to perform a series of actions that can only be performed accurately if the prover knows the underlying information. The prover and verifier interact in multiple rounds of the protocol, and in the conclusion, the verifier develops confidence in the veracity of the claim without learning any additional information about the secret.\nZero-knowledge proofs are being noticed in various fields, particularly in the area of blockchain technology. They allow for the verification of information without revealing the underlying data, aiming to provide a level of security and privacy. For instance, in the context of blockchain networks, the only information revealed on-chain by a ZKP is that some piece of hidden information is valid and known by the prover with a high degree of certainty.\nZero-knowledge proofs have certain drawbacks. These include hardware costs associated with the computational power needed to generate and verify proofs, proof verification costs, and trust assumptions. Moreover, there are potential threats from quantum computing, which could potentially break the cryptographic security provided by ZKPs.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-delegated-proof-of-stake-dpos",
    "text": "DPoS is a consensus mechanism that evolved from Proof of Stake (PoS), intending to enhance the process's democratic nature and efficiency.\nIn DPoS, network users vote and elect delegates who validate the next block, aiming to make it a democratic process.\nDespite its potential benefits, DPoS has been critiqued for possibly favoring the wealthy and requiring constant user engagement.\nDelegated Proof of Stake (DPoS) is a consensus mechanism that evolved from the classic Proof of Stake (PoS) system. It was first conceived by Daniel Larimer in 2013 and utilized in his project BitShares. In DPoS, users of the network vote in delegates, also known as validators, to verify and produce blocks. After they successfully produce a block, these validators may then distribute their block rewards to those who voted for them.\nDPoS intends to enhance the efficiency and democratic nature of block verification. It does this by allowing network users to vote and elect delegates who validate the next block. This democratic process is designed to address some of the limitations of the PoS system, such as the potential for centralization of power among those with the most tokens staked.\nIn a DPoS system, network users vote and elect delegates, who are also referred to as 'witnesses' or 'block producers'. Only a certain number of these delegates are permitted, and they can change, as others can be voted in instead.\nUsers of the network can pool tokens into a staking pool and vote for the particular delegate they wish. When staking, users of the network do not need to send their tokens to a particular wallet; instead, there is a staking mechanism or service provider they can operate through.\nDelegates play a crucial role in verifying the accuracy of transactions; and, if they validate the block correctly, they are then compensated with the transaction fees, which can be distributed to the individuals who voted them in. The more that a user is able to stake, the larger the allotment they can receive.\nLike any consensus mechanism, DPoS has its potential benefits and drawbacks. On the positive side, DPoS is designed for speed, scalability, and minimal hardware requirements. It also allows for voting power, which can make the process more democratic.\nHowever, DPoS also has its drawbacks. For one, it can potentially favor malicious token holders. It also requires constant engagement from users, which can be a barrier for some. Lastly, there is a potential lack of decentralization, as the system can favor those with the most tokens staked.\nSeveral projects employ DPoS in their blockchains. These projects have found that DPoS provides a democratic and efficient method for transaction validation and securing their networks.\nHowever, it's crucial to note that each project may implement DPoS differently, depending on their specific needs and goals. As such, the specific workings of DPoS can vary significantly between different blockchains. Despite these variations, the fundamental principle of DPoS remains the same: to provide a democratic and efficient way to reach consensus in a blockchain network.\nCompared to Proof of Work (PoW) and Proof of Stake (PoS), DPoS is designed to provide a democratic and efficient method for transaction validation. While PoW requires significant computational power and energy consumption, and PoS can potentially favor those with the most tokens staked, DPoS aims to balance efficiency and fairness through its voting and delegation mechanism.\nHowever, like any consensus mechanism, DPoS is not without its challenges. It requires constant user engagement and can potentially favor those with the most tokens staked. Despite these challenges, DPoS remains a popular choice for many blockchain projects due to its potential for efficiency and democratic decision-making.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-layer-0-protocols",
    "text": "Layer-0 protocols are the foundational infrastructure upon which Layer-1 blockchains are built.\nThey aim to address the challenges of scalability, interoperability, and developer flexibility in the blockchain industry.\nNotable examples of Layer-0 networks include Cosmos, Polkadot, and Avalanche.\nLayer-0 protocols form the foundation upon which Layer-1 blockchains are constructed. They serve as the infrastructure for blockchain networks and applications, aiming to address industry issues such as scalability and enabling interoperability between blockchains. Layer-0 protocols enable developers to launch customised Layer-1 blockchains designed for specific applications or use cases. With the support of Layer-0s, developers can focus on applications instead of consensus and security.\nSeveral Layer-0 protocols adopt a relay/sidechain-based infrastructure, which mainly consists of three components. A mainchain supports the data transfer between Layer-1s, while sidechains are application-specific Layer-1s connected to the mainchain. The interchain communication protocol acts as a standard for data exchange amongst the Layer-1s. Cosmos, Polkadot, and Avalanche are notable examples of Layer-0 networks that use this relay/sidechain structure.\nLayer-0 protocols aim to allow Layer-1 blockchains to communicate and interoperate, striving to provide users with a seamless experience across multiple networks. Without the interoperability solutions provided by Layer-0 networks, individual blockchains would largely operate in isolation. This limits their utility and hinders the networking effects that arise when systems cannot communicate and interact with each other.\nIn the coming years, Layer-0 protocols may contribute to future blockchain developments by enabling the growth of multiple specialised Layer-1 blockchains that interoperate seamlessly. This could lead to a more tightly interwoven network of blockchain-enabled products and services, aiming to enhance user experience.\nLayer-0 protocols aim to address the \"blockchain trilemma\" - the challenge developers face in creating a blockchain protocol that is decentralized, secure, and scalable without any trade-offs made between all three aspects. By creating a more flexible base infrastructure and allowing developers to launch their own purpose-specific blockchains, Layer-0 protocols aim to address challenges such as scalability and interoperability.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-socialfi",
    "text": "SocialFi combines the principles of social media and decentralized finance, aiming to provide a decentralized approach to social media platforms.\nIt seeks to empower content creators, influencers, and participants by giving them control over their data, freedom of speech, and the potential to receive compensation for their social media engagement.\nSocialFi platforms are structured as decentralized autonomous organizations (DAOs), which are better suited to prevent centralized censorship decisions.\nSocialFi, short for Social Finance, is a blend of social media networks and decentralized finance (DeFi). It is a decentralized approach to social media, where users have control over their content as no central authorities are running the networks. SocialFi aims to give value back to content creators, allowing them to create whatever they want and have more control over their data. Users on SocialFi platforms can potentially benefit from their engagement and following, as there are no limitations to what can be monetized.\nDecentralized Autonomous Organizations (DAOs) and social tokens play a role in running SocialFi platforms. DAOs are in charge of the platforms’ governance and ensure no central authority controls user activity on the networks. The DAOs also prevent developers and the rest of the teams from altering the platforms’ code. That means every decision, including incentive sharing, depends entirely on the DAO. The platforms’ potential for compensation depends on social DeFi tokens, which could either be native tokens or other traded assets on the platform. Besides the in-app tokens, content creators can develop their tokens, which they can use to receive compensation for their social interactions.\nBalancing incentives across all stakeholders is a key design principle of Web3 applications, which is made possible by the DAO model. SocialFi apps aim to take it one step further by using the concept of social tokens or in-app utility tokens. These tokens are not just at the application level but can be created at a user level. Creators can now manage their own economies through social tokens. Every user with meaningful brand equity can have their own token. The value of the token will be directly proportional to the social clout of the user.\nThe overarching aim of SocialFi is to create a more transparent, equitable, and user-centric digital social media landscape. However, to gain mass adoption, SocialFi platforms must overcome two major challenges - scalability and economic sustainability. Despite these challenges, the potential of SocialFi to disrupt the social media industry by sticking to Web3 ethos is immense. It is focused on solving key design issues around aspects of Web2 social media platforms as we know them today. As blockchain technology continues to evolve, the future of SocialFi is a topic of interest.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-impermanent-loss",
    "text": "Impermanent loss is a risk that occurs when participating in DeFi liquidity pools, where the value of your allocated assets changes from the time you allocated them.\nThis loss is termed 'impermanent' because it can be mitigated if the token price returns to its original value.\nWhile impermanent loss presents risks, providing liquidity also provides rewards through trading fees and additional tokens.\nImpermanent loss refers to a situation where the compensation you receive from allocating a token in a liquidity pool is less than what you would have received just holding the asset. This happens when a token’s price changes in the market, causing your allocated assets in the liquidity pool to become worth less than their present value in the market. The larger this price change, the more your assets are exposed to impermanent loss.\nFor instance, if the value of the assets in the pool changes significantly, the user may experience impermanent loss. This gap is “impermanent” because it is possible to close the gap if the token price returns to the former price.\nImpermanent loss does not necessarily prevent liquidity providers from receiving compensation. This loss is only tangible if investors withdraw their liquidity from the pool at that exact moment in time. Often, pools employ strategies to offset this loss, such as charging high fees. Therefore, liquidity providers receive more from fees to cover their impermanent loss.\nHowever, in case of a considerable price difference, your fee compensation might not cover the loss. In this case, you would have gained more value if you held the assets instead of providing liquidity.\nCalculating your exact loss might be a little tricky due to the complexity of some of its variables. But you can estimate your loss with the formula below:\nImpermanent Loss = 2 * sqrt(price_ratio) / (1+price_ratio) – 1\nThe price ratio is the ratio between the token price at allocation and withdrawal.\nWhile you can’t avoid impermanent loss, you can reduce exposure. Here are some tips to help:\nThe more volatile the assets, the more impermanent loss is likely to occur. Use more stable tokens like stablecoins or BTC to reduce the chance of impermanent loss.\nEnsure you also use tried and tested Automated Market Makers to reduce your exposure to market manipulation.\nStart by allocating a small amount to diversify your portfolio and reduce the percentage of your assets exposed to impermanent loss.\nImpermanent Loss Protection (ILP) is a type of insurance that protects liquidity providers from unexpected losses. Liquidity provisioning is only beneficial on typical AMMs if the benefits of farming surpass the cost of temporary loss. However, if the liquidity providers suffer losses, they can utilize ILP to protect themselves against impermanent loss. To activate ILP, tokens must be allocated on a farm.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-real-world-assets-rwa",
    "text": "Real-World Assets (RWAs) are tangible assets that exist outside the digital spectrum, which can be tokenized and brought into the blockchain ecosystem.\nTokenization of RWAs aims to enhance liquidity, transparency, and accessibility, enabling a broader range of individuals to engage with high-value assets.\nDespite the potential benefits, tokenization of RWAs also presents challenges such as regulatory considerations and security issues.\nReal-World Assets (RWAs) refer to tangible assets that exist outside the digital realm. These can range from bonds to real estate properties, commodities, and machinery. The concept of RWAs in the blockchain context is about digital tokens that represent these physical and traditional financial assets. This includes currencies, commodities, equities, and bonds. The tokenization of RWAs is seen as one of the largest market opportunities in the blockchain industry, with a potential market size in the hundreds of trillions of dollars.\nTokenization is the process of converting real-world assets into digital tokens through blockchain technology. This process aims to enable fractional ownership and make high-value assets more accessible to a wider variety of individuals by facilitating the division of assets into smaller, more affordable units. Tokenized real-world assets, such as real estate, art, commodities, and even intellectual property, strive to offer greater liquidity, transparency, and accessibility. This digitization of physical assets is often seen as a way to modernize and democratize conventional financial markets.\nTokenizing real-world assets brings several benefits. Enhanced liquidity is one of the most significant advantages. Unlike traditional markets with set trading hours, the nature of blockchain technology allows for continuous engagement with these tokens, providing individuals with more flexibility. Moreover, the transparency built into blockchain technology increases investor confidence, further reducing the possibility of fraud and ownership conflicts. Tokenization also aims to lower the costs associated with asset management, such as paperwork, intermediaries, and legal fees, by removing many of the entry barriers prevalent in traditional financial markets.\nDespite the potential benefits, tokenization of RWAs also presents challenges. Regulatory considerations that differ by jurisdiction are a significant concern. Any tokenization project must adhere to local laws and regulations. Security is another crucial issue due to the vulnerability of digital assets to fraud and hacking. Effective custody solutions and security measures are required to preserve these assets.\nRWAs find a place within the Decentralized Finance (DeFi) ecosystem, increasing the availability of these often inaccessible financial tools and opening up new horizons of applications. The tokenization of RWAs may contribute to the broader acceptance of the crypto industry. With the potential to influence global economies, the opportunity exists. Its acceptance in traditional finance is ongoing. Nonetheless, technology can change how we interact with and engage in physical assets.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-nft-finance",
    "text": "NFT Finance (NFTFi) is an ecosystem that combines Non-Fungible Tokens (NFTs) and Decentralized Finance (DeFi) with the intention to unlock additional value, opportunity, and liquidity in the NFT market.\nNFTFi provides decentralized financial services for NFT market participants, enabling them to generate potential compensation, unlock liquidity, diversify exposure, and engage with the NFT finance ecosystem.\nNFTFi applications include NFT lending and borrowing, NFT fractionalization, and the creation of derivative and prediction markets around NFTs.\nNFTFi, or “NFT finance,” refers to the ecosystem of decentralized protocols and applications providing financial utility to NFTs. It sits at the intersection of NFTs and decentralized finance (DeFi), with the intention to unlock additional value, opportunity, and liquidity for the NFT market.\nNFTFi is still nascent, and there is potential for building innovative models for unlocking additional NFT utility. At its core, NFTFi seeks to provide decentralized financial services for NFT market participants.\nNFTFi protocols provide DeFi functionality to NFTs—unlocking the ability to rent, borrow, and fractionalize NFTs, create derivative and prediction markets around them, and more.\nFor instance, NFTFi lending and borrowing protocols enable NFT holders to lock up their digital assets as collateral to unlock liquidity in another digital asset. An NFT owner locks up their NFT with a protocol, borrows fungible digital assets by compensating lenders over time, with the NFT acting as collateral in case the NFT owner defaults on their loan. The NFT owner can repay their loan to receive back their NFT at any time.\nNFTFi has several applications that provide opportunities for users.\nOne of the applications is NFT lending and borrowing. Similar to DeFi money markets, NFTFi lending and borrowing protocols enable NFT holders to lock up their digital assets as collateral to unlock liquidity in another digital asset.\nAnother application is NFT fractionalization, which is the process of locking up an NFT and then minting fungible tokens that—as a whole—represent the underlying NFT. This provides benefits to both NFT owners and prospective buyers.\nNFTFi provides several benefits, including the ability to unlock liquidity from NFTs without necessarily having to sell the NFT itself.\nIt also provides novel forms of compensation for lenders and encourages better price discovery, as fungible tokens are more liquid than their non-fungible counterparts.\nHowever, NFTFi also faces challenges such as low liquidity, high price volatility, and significant transaction costs and delays associated with blockchain transactions.\nDespite these challenges, NFTFi continues to develop and evolve, providing opportunities for innovation in the cryptocurrency space.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-sandwich-attacks-in-crypto",
    "text": "Sandwich attacks are a form of market manipulation on decentralized exchanges (DEXs).\nThese attacks exploit the transparency and immutability of blockchain technology to the attacker's advantage.\nUnderstanding sandwich attacks can help users protect themselves and make more informed decisions in the crypto space.\nA sandwich attack is a strategic exploitation of a transaction initiated by a user on a decentralized exchange. The attacker places one order right before the user's transaction and one right after it, effectively \"sandwiching\" the user's transaction.\nThis form of market manipulation leverages the fundamental principles of blockchain technology, such as transparency and immutability, to the attacker's advantage, often at the expense of regular users.\nIn a sandwich attack, a malicious trader identifies a pending transaction on the network, for example, Ethereum. The attacker then places an order before the user's transaction (front-running) and another one right after it (back-running). The intention is to influence the price of the cryptocurrency being traded, which could potentially benefit the attacker.\nFor instance, the front-run order might drive up the price of the cryptocurrency, causing the user to pay more. The back-run order could then be used to sell the cryptocurrency, potentially causing the price to drop and leaving the user with a less valuable asset.\nSandwich attacks may have consequences for users and the broader crypto market.\nFor the individual user, a sandwich attack can result in financial loss as they may end up paying more for a cryptocurrency than its actual market value. On a larger scale, these attacks can contribute to price volatility and undermine trust in decentralized exchanges.\nThere are several strategies users can employ to protect themselves against sandwich attacks.\nOne approach is to use a higher gas price for transactions, as this can make it more expensive for an attacker to front-run or back-run the user's transaction.\nAnother strategy is to avoid making large trades that could attract the attention of attackers.\nUsers may also consider using technologies or platforms that aim to obscure transaction details, making it harder for attackers to identify potential targets.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-etherscan-and-how-to-use-it",
    "text": "Etherscan is a block explorer and analytics platform for the Ethereum blockchain.\nIt allows users to access and understand transaction data, wallet balances, smart contracts, and more.\nEtherscan is a tool available for use that can be utilized to gain insights into Ethereum-based activities and to track transactions in real-time.\nEtherscan is a block explorer and analytics platform that tracks and sorts the Ethereum blockchain’s data into easily navigable information.\nIt allows users to access information on a wide range of Ethereum activities such as ERC-20 token transactions, NFT mints, smart contract details, wallet balances, and more.\nEtherscan is not a wallet or a wallet service provider, but rather a tool that allows users to explore and understand the Ethereum blockchain in a user-friendly manner.\nBlock explorers help visualize the data related to a blockchain, and we can imagine them as blockchain search engines. They translate technical blockchain data and present it to users via a friendly interface. This makes it easy to sort and filter the data you need.\nEtherscan works in three principal parts: retrieving Ethereum data in real-time, maintaining an organized data record, and presenting near real-time data to users.\nIt retrieves data from Ethereum using a software communication protocol called RPC and maintains an organized record of this data. With a friendly interface, Etherscan lets users search for any desired Ethereum data.\nUsers can use the search bar or navigate to different sections of the website to find what they’re looking for.\nEtherscan is a block explorer that can be used to explore any and all Ethereum-based wallet addresses. You can look up a wallet address to observe the amount of ETH it manages alongside other ERC-20 tokens and NFTs (ERC-721 tokens).\nIf you want to dig deeper, you can also click on any transaction ID in the transaction history section to observe the transaction’s details. This includes ETH used for gas, the smart contract used, the recipient wallet address, and the transaction time, date, and amount.\nTo use Etherscan, you'll need a wallet address, transaction ID (TXID), contract address, or another identifier to paste into the search field. The information you'll observe will depend on what you're looking at, but most of it will include associated transactions, addresses, timestamps, and amounts.\nYou can also interact directly with smart contracts to process transactions, observe gas fees, and search for airdrops through Etherscan.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-a-blockchain-genesis-block",
    "text": "The genesis block is the first block in a blockchain, often referred to as block 0 or block 1.\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-are-bitcoin-layer-2-blockchains",
    "text": "Bitcoin Layer 2 blockchains are protocols built on top of the Bitcoin blockchain that strive to enhance its scalability and transaction efficiency.\nThey seek to address Bitcoin's limitations around transaction throughput, block confirmation time, and transaction costs.\nExamples of Bitcoin Layer 2 solutions include the Lightning Network, Rootstock, Stacks, and Liquid Network.\nBitcoin Layer 2 blockchains strive to address the scalability issues of the Bitcoin network.\nIndeed, the Bitcoin network, while secure and decentralized, suffers from slow transaction speeds, low throughput, and rising transaction costs. This is due to its limited capacity to handle large amounts of transaction data within a set time frame.\nBitcoin Layer 2 solutions are designed to process transactions off the main blockchain, thereby aiming to reduce the load on the network and increase efficiency. They also strive to enhance the programmability of Bitcoin and unlock new utilities such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\nBitcoin Layer 2 solutions operate on the principle of off-chain processing. This means that transactions occur outside the main blockchain, aiming to reduce the load on the network.\nBy creating off-chain channels, users can conduct multiple transactions without the need for each transaction to be added directly to the blockchain. This not only aims to increase transaction throughput but also strives to minimize fees, making microtransactions and point-of-sale transactions more practical.\nThere are several mechanisms that underpin the functionality of Bitcoin Layer 2 networks, including state channels, rollup chains, and sidechains.\nThere are several Bitcoin Layer 2 solutions that have emerged to address the scalability issues of the Bitcoin network. These include:\nBitcoin Layer 2 solutions aim to significantly enhance the scalability and functionality of the Bitcoin network.\nThey strive to help overcome Bitcoin's limitations around transaction throughput, block confirmation time, and transaction costs. They also strive to enhance the programmability of Bitcoin, unlocking new utilities on other verticals like payments, DeFi, NFTs, and other market venues.\nBy doing so, they aim to improve Bitcoin's overall performance, all while benefiting from its security and network effects.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn#advanced-trading",
    "text": "Beginner guides, practical tips, and market updates for first-timers, experienced investors, and everyone in between\nWhen prices are fluctuating, how do you know when to buy? Learn more about using dollar-cost averaging to weather price volatility.\nSee more\nSee more\nSee more\nSee more\nNew to crypto? Not for long — start with these guides and explainers\nBitcoin is the world's first widely adopted cryptocurrency — it allows for secure and seamless peer-to-peer transactions on the internet.\nFrom Aave to Zcash, decide what to trade with our beginner's guide\nSee more crypto basics\nGet practical, step-by-step answers to all things crypto\nSee more tips and tutorials\nReady to advance? Learn the tools and terminology you need to take control of your trades.\nSee more advanced trading\nNew to futures trading? Get up to speed on the basics.\nSee more about futures\nEarn yield, dive into crypto apps, control your holdings, and much more\nAnd how can a wallet help me access NFTs or DeFi? Your self-custody wallet questions, answered\nLearn how to setup and get started with a crypto wallet.\nA quick guide on how to add crypto to your Coinbase self-custody wallet.\nCoinbase Wallet helps you unlock one of the most significant features of crypto: the ability to send or receive peer-to-peer transfers without any financial intermediaries.\nSee more Wallet articles\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-glossary/what-is-erc-20",
    "text": "ERC-20 is a technical standard for establishing fungible assets on the Ethereum blockchain.\nIt provides a set of rules that ensure assets function properly within the Ethereum ecosystem.\nERC-20 assets can symbolize various digital assets and are utilized in a wide range of applications.\nERC-20, or Ethereum Request for Comment 20, is a technical standard used for issuing and implementing assets on the Ethereum blockchain. It was proposed in 2015 by Ethereum developer Fabian Vogelsteller. The standard outlines a common set of rules that an asset must follow to function correctly within the Ethereum ecosystem. These rules pertain to how ERC-20 assets are transferred within the Ethereum blockchain and how their supply and address balances are consistently recorded.\nThe primary purpose of the ERC-20 standard is to ensure interoperability between different assets and applications on the Ethereum blockchain. This interoperability makes it easier for developers to predict how different assets will interact with each other and with various applications. ERC-20 assets can be used to symbolize a wide range of digital assets or tradable goods, such as digital tokens, vouchers, gold certificates, loyalty points, and IOUs. They can also be used to tokenize voting rights during elections.\nThe introduction of the ERC-20 standard has influenced the Ethereum ecosystem. It has simplified the process of establishing and issuing a digital asset, leading to a surge in interest in ICO crowdfunding events and blockchain technology as a whole. As of now, there are more than 350,000 ERC-20 assets on Ethereum, including well-known assets like Tether (USDT), Binance USD (BUSD), Polygon (MATIC), and Shiba Inu Coin (SHIB).\nERC-20 assets are the utility assets of the Ethereum blockchain. They each have unique functions and are designed for different purposes within the ecosystem. ERC-20 assets can be stored in most ETH wallets and sent to any Ethereum wallet address. They symbolize association with any fungible asset and are established on the Ethereum Network using smart contracts.\nThe future of ERC-20 is anticipated to continue contributing to the growth of the Ethereum ecosystem. The standard has empowered developers to build on Ethereum, facilitating a network effect that has resulted in the emergence of numerous new assets. As the Ethereum ecosystem continues to evolve, the ERC-20 standard is likely to play a crucial role in its development.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-the-difference-between-a-coin-and-a-token",
    "text": "We use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy.\nLearn how we collect your information by visiting our Privacy Policy"
  },
  {
    "url": "https://www.coinbase.com/learn/crypto-basics/what-is-a-token",
    "text": "Definition\nTechnically, “token” is just another word for “cryptocurrency” or “cryptoasset.” But increasingly it has taken on a couple of more specific meanings depending on context. The first is to describe all cryptocurrencies besides Bitcoin and Ethereum (even though they are technically also tokens). The second is to describe certain digital assets that run on top of another cryptocurrencies’ blockchain, as many decentralized finance (or DeFi) tokens do. Tokens have a huge range of potential functions, from helping make decentralized exchanges possible to selling rare items in video games. But they can all be traded or held like any other cryptocurrency.\n“Token” is a word that you hear a lot in cryptocurrency. In fact, you might hear Bitcoin described as a “crypto token” or something similar, because — technically — all cryptoassets can also be described as tokens. But the word has increasingly taken on two specific meanings that are common enough that there’s a good chance you’ll encounter them. \nA “token” often refers to any cryptocurrency besides Bitcoin and Ethereum (even though they are also technically tokens). Because Bitcoin and Ethereum are by far the biggest two cryptocurrencies, it’s useful to have a word to describe the universe of other coins. (Another word you might hear with virtually the same meaning is “altcoin.”)\nThe other increasingly common meaning for “token” has an even more specific connotation, which is to describe cryptoassets that run on top of another cryptocurrency’s blockchain. You’ll encounter this usage if you become interested in decentralized finance (or DeFi). While a cryptocurrency like Bitcoin has its own dedicated blockchain, DeFi tokens like Chainlink and Aave run on top of, or leverage, an existing blockchain, most commonly Ethereum’s. \nTokens in this second category help decentralized applications to do everything from automate interest rates to sell virtual real estate. But they can also be held or traded like any other cryptocurrency.\nGiven that you’ll come across the word a lot while researching cryptocurrencies, it’s useful to understand some common connotations. But besides the big-picture definitions in the section above, there are also some categories of cryptoassets that actually have “token” in their name. Here are a few examples of those:\nDeFi tokens A new world of cryptocurrency-based protocols that aim to reproduce traditional financial-system functions (lending and saving, insurance, trading) has emerged in recent years. These protocols issue tokens that perform a wide variety of functions but can also be traded or held like any other cryptocurrency.\nGovernance tokens These are specialized DeFi tokens that give holders a say in the future of a protocol or app, which (being decentralized) don’t have boards of directors or any other central authority. The popular savings protocol Compound, for example, issues all users a token called COMP. This token gives holders a vote in how Compound is upgraded. The more COMP tokens you have, the more votes you get.\nNon-Fungible Tokens (NFTs)  NFTs represent ownership rights to a unique digital or real-world asset. They can be used to make it more difficult for digital creations to be copied and shared (an issue anyone who has ever visited a Torrent site full of the latest movies and video games understands). They’ve also been used to issue a limited number of digital artworks or sell unique virtual assets like rare items in a video game. \nSecurity tokens Security tokens are a new class of assets that aim to be the crypto equivalent of traditional securities like stocks and bonds. Their main use case is to sell shares in a company (very much like the shares or fractional shares sold via conventional markets) or other enterprises (for instance, real estate) without the need for a broker. Major companies and startups have been reported to be investigating security tokens as a potential alternative to other methods of fundraising.\nA selection of cryptocurrencies in the top 50 by market cap.\nStellar Lumens\nNEAR Protocol\nOFFICIAL TRUMP\nBonk\nSolana\nChainlink\nRender (ERC-20)\nAvalanche\nInternet Computer\nRender\nFilecoin\nCardano\nWe're the most trusted place for people and businesses to buy, sell, and manage crypto.\nGet started\nUnited States\nEnglish\nWe use cookies and similar technologies on our websites to enhance and tailor your experience, analyze our traffic, and for security and marketing. You can choose not to allow some type of cookies by clicking Manage Settings. For more information see our Cookie Policy."
  }
]